Repository: Distrotech/man-db
Catalog: man/po4a/po/*.po
Languages: id

source: Manual pager utils
id: Utiliti pager manual

source: NAME
id: NAMA

source: %apropos% - search the manual page names and descriptions
id: %apropos% - cari nama halaman manual dan deskripsinya

source: SYNOPSIS
id: RANGKUMAN

source: B<%apropos%> [\|B<-dalhvV>\|] [\|B<-e>\||\|B<-w>\||\|B<-r>\|] [\|B<-s> I<section>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-L> I<locale>\|] [\|B<-C> I<file>\|] I<keyword> \&.\|.\|.
id: B<%apropos%> [\|B<-dalhvV>\|] [\|B<-e>\||\|B<-w>\||\|B<-r>\|] [\|B<-s> I<bagian>\|] [\|B<-m> I<sistem>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<jalur>\|] [\|B<-L> I<lokal>\|] [\|B<-C> I<berkas>\|] I<kata kunci> \&.\|.\|.

source: DESCRIPTION
id: DESKRIPSI

source: Each manual page has a short description available within it. B<%apropos%> searches the descriptions for instances of I<keyword>.
id: Setiap halaman manual memiliki sebuah deskripsi singkat didalamnya. B<%apropos%> mencari deskripsi untuk instance dari I<kata kunci>.

source: I<keyword> is usually a regular expression, as if (B<-r>) was used, or may contain wildcards (B<-w>), or match the exact keyword (B<-e>). Using these options, it may be necessary to quote the I<keyword> or escape (\e) the special characters to stop the shell from interpreting them.
id: I<kata kunci> biasanya sebuah ekspresi regular, sama seperti (B<-r>) yang telah digunakan, atau mungkin berisi wildcards (B<-w>), atau yang cocok dengan kata kunci tepat (B<-e>). Menggunakan opsi ini, mungkin diperlukan untuk quote I<kata kunci> atau escape (\e) karakter spesial untuk shell dari menginterpretasikannya.

source: The standard matching rules allow matches to be made against the page name and word boundaries in the description.
id: Aturan standar pencocokan mengijinkan pencocokan untuk dibuat terhada nama halaman dan batas kata dalam deskripsi.

source: The database searched by B<%apropos%> is updated by the B<%mandb%> program. Depending on your installation, this may be run by a periodic cron job, or may need to be run manually after new manual pages have been installed.
id: Basis data dicari dengan B<%apropos%> di update oleh aplikasi B<%mandb%>. Tergantung di instalasi anda, ini mungkin akan dijalankan secara periodik oleh pekerjaan cron, atau mungkin bisa dijalankan secara manual setelah halaman manual telah terpasang.

source: OPTIONS
id: OPSI

source: Print debugging information.
id: Tampilkan informasi debugging.

source: Print verbose warning messages.
id: Tampilkan pesan peringatan verbose.

source: Interpret each keyword as a regular expression. This is the default behaviour. Each keyword will be matched against the page names and the descriptions independently. It can match any part of either. The match is not limited to word boundaries.
id: Interpretasikan setiap kata kunci sebagai sebuah ekspresi regular. Ini adalah perilaku baku. Untuk setiap kata kunci yang akan dicocokan terhadap nama dan deskripsi halaman secara independen. Ini dapat cocok dengan bagian apapun juga. Pencocokan tidak terbatas ke batasan kata.

source: Interpret each keyword as a pattern containing shell style wildcards. Each keyword will be matched against the page names and the descriptions independently. If B<--exact> is also used, a match will only be found if an expanded keyword matches an entire description or page name. Otherwise the keyword is also allowed to match on word boundaries in the description.
id: Interpretasikan setiap kata kunci sebagai sebuah pola berisi gaya shell wildcards. Setiap kata kunci akan dicocokan terhadap nama dan deskripsi halaman secara independen. Jika B<--exact> juga digunakan, sebuah pasangan hanya akan ditemukan jika sebuah kata kunci yang diekspan cocok ke seluruh deskripsi atau nama halaman. Jika tidak kata kunci juga diijinkan untuk mencocokan di batas kata dalam deskripsi.

source: Each keyword will be exactly matched against the page names and the descriptions.
id: Setiap kata kunci akan secara tepat dicocokan terhadap nama dan deskripsi halaman.

source: Only display items that match all the supplied keywords. The default is to display items that match any keyword.
id: Hanya tampilkan item yang cocok dengan seluruh kata kunci yang diberikan. Secara baku adalah menampilkan item yang cocok dengan kata kunci apapun.

source: Do not trim output to the terminal width. Normally, output will be truncated to the terminal width to avoid ugly results from poorly-written B<NAME> sections.
id: Jangan trim keluaran ke lebar terminal. Secara normal, keluaran akan dipotong ke lebar terminal untuk menghindari hasil aneh dari bagian B<NAMA> yang ditulis tidak sempurna.

source: B<-s> I<section>, B<--section> I<section>
id: B<-s> I<bagian>, B<--section> I<bagian>

source: Search only the given manual section. If I<section> is a simple section, for example "3", then the displayed list of descriptions will include pages in sections "3", "3perl", "3x", and so on; while if I<section> has an extension, for example "3perl", then the list will only include pages in that exact part of the manual section.
id: Hanya cari di bagian manual yang diberikan. Jika I<bagian> adalah sebuah bagian sederhana, sebagai contoh "3", maka tampilkan daftar dari deskripsi akan memasukan halaman dalam bagian "3", "3perl", "3x", dan selanjutnya; jika I<bagian> memiliki sebuah ekstensi, sebagai contoh "3perl", maka daftar hanya akan memasukan halaman dalam bagian tepat dari bagian manual.

source: B<-m> I<system>\|[\|,.\|.\|.\|]\|B<,> B<--systems=>I<system>\|[\|,.\|.\|.\|]
id: B<-m> I<sistem>\|[\|,.\|.\|.\|]\|B<,> B<--systems=>I<sistem>\|[\|,.\|.\|.\|]

source: If this system has access to other operating system's manual page descriptions, they can be searched using this option. To search NewOS's manual page descriptions, use the option B<-m> B<NewOS>.
id: Jika sistem ini memiliki akses ke deskripsi halaman manual sistem operasi lain, mereka dapat dicari dengan opsi ini. Untuk mencari deskripsi halaman manual OS-Baru, gunakan opsi B<-m> B<OS-Baru>.

source: The I<system> specified can be a combination of comma-delimited operating system names. To include a search of the native operating system's B<whatis> descriptions, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
id: I<sistem> yang dispesifikasikan dapat berupa sebuah kombinasi dari nama sistem operasi dipisahkan oleh koma. Untuk memasukan sebuah pencarian dari deskripsi sistem operasi asal B<whatis>, masukan nama sistem B<man> dalam argumen string. Opsi ini akan override variabel lingkungan $B<SISTEM>.

source: B<-M\ >I<path>B<,\ --manpath=>I<path>
id: B<-M\ >I<jalur>B<,\ --manpath=>I<jalur>

source: Specify an alternate set of colon-delimited manual page hierarchies to search. By default, B<%program%> uses the $B<MANPATH> environment variable, unless it is empty or unset, in which case it will determine an appropriate manpath based on your $B<PATH> environment variable. This option overrides the contents of $B<MANPATH>.
id: Spesifikasikan sebuah alternatif set dari struktur halaman manual dipisahkan dipisahkan oleh kolon ke pencarian. Secara Baku, B<%program%> menggunakan variabel lingkungan $B<MANPATH>, kecuali itu kosong atau tidak diset, dalam beberapa kasus itu akan menentukan sebuah jalur man yang sesuai di variabel lingkungan anda $B<PATH>. Opsi ini override isi dari $B<MANPATH>.

source: B<%program%> will normally determine your current locale by a call to the C function B<setlocale>(3) which interrogates various environment variables, possibly including $B<LC_MESSAGES> and $B<LANG>. To temporarily override the determined value, use this option to supply a I<locale> string directly to B<%program%>. Note that it will not take effect until the search for pages actually begins. Output such as the help message will always be displayed in the initially determined locale.
id: B<%program%> akan secara normal menentukan lokal sekarang anda dengan sebuah panggilan ke fungsi B<setlocale>(3) yang meninterogasi berbagai variabel lingkungan, kemungkinan termasuk $B<LC_MESSAGES> dan $B<LANG>. Untuk sementara override nilai yang telah ditentukan, gunakan opsi ini untuk mensuppli sebuah I<locale> string secara langsung ke B<%program%>. Catat bahwa itu tidak akan memberikan efek sampai pencarian untuk halaman benar benar dimulai. Keluaran seperti pesan bantuan akan selalu ditampilkan dalam local yang ditentukan pada saat inisial.

source: B<-C\ >I<file>B<,\ --config-file=>I<file>
id: B<-C\ >I<berkas>B<,\ --config-file=>I<berkas>

source: Use this user configuration file rather than the default of I<~/.manpath>.
id: Gunakan berkas konfigurasi pengguna ini daripada baku dari I<~/.manpath>.

source: Print a help message and exit.
id: Tampilkan sebuah pesan bantuan dan keluar.

source: Display version information.
id: Tampilkan informasi versi.

source: EXIT STATUS
id: STATUS KELUAR

source: Successful program execution.
id: Eksekusi aplikasi sukses.

source: Usage, syntax or configuration file error.
id: Penggunaan, sintaks atau berkas konfigurasi error.

source: Operational error.
id: Operasional error.

source: Nothing was found that matched the criteria specified.
id: Tidak ditemukan apa apa yang cocok dengan kriteria yang dispesifikasikan.

source: ENVIRONMENT
id: LINGKUNGAN

source: If $B<SYSTEM> is set, it will have the same effect as if it had been specified as the argument to the B<-m> option.
id: Jika $B<SISTEM> telah diset, ini akan memiliki efek sama seperti jika ini telah dispesifikasikan sebagai argumen ke opsi B<-m>.

source: If $B<MANPATH> is set, its value is interpreted as the colon-delimited manual page hierarchy search path to use.
id: Jika $B<MANPATH> telah diset, nilainya diinterpretasikan sebagai struktur jalur pencarian halaman manual dipisahkan dengan kolon untuk digunakan.

source: If $B<MANWIDTH> is set, its value is used as the terminal width (see the B<--long> option). If it is not set, the terminal width will be calculated using an B<ioctl>(2) if available, the value of $B<COLUMNS>, or falling back to 80 characters if all else fails.
id: Jika $B<MANWIDTH> di set, nilainya digunakan sebagai lebar termila (lihat opsi B<--long>). Jika itu tidak diset, lebar terminal tidak akan dipertimbangkan menggunakan sebuah B<ioctl>(2) jika tersedia, nilai dari $B<KOLOM>, atau kembali ke 80 karakter jika yang lain gagal.

source: If $B<POSIXLY_CORRECT> is set, even to a null value, the default B<%apropos%> search will be as an extended regex (B<-r>). Nowadays, this is the default behaviour anyway.
id: Jika $B<POSIXLY_CORRECT> diset, meskipun ke sebuah nilai null, pencarian baku B<%apropos%> akan berupa sebuah ekstensi regex (B<-r>). Saat ini, ini adalah perilaku baku.

source: FILES
id: BERKAS

source: A traditional global I<index> database cache.
id: Sebuah tradisional global I<indeks> basis data cache.

source: An FHS compliant global I<index> database cache.
id: Sebuah FHS komplian global I<indeks> basis data cache.

source: A traditional B<whatis> text database.
id: Sebuah tradisional B<whatis> teks basis data.

source: SEE ALSO
id: LIHAT JUGA

source: AUTHOR
id: PENGARANG

source: lexgrog - parse header information in man pages
id: lexgrog - parse informasi header dalam halaman manual

source: B<lexgrog> [\|B<-m>\||\|B<-c>\|] [\|B<-fhwV>\|] [\|B<-E> I<encoding>\|] I<file> \&.\|.\|.
id: B<lexgrog> [\|B<-m>\||\|B<-c>\|] [\|B<-fhwV>\|] [\|B<-E> I<pengkodean>\|] I<berkas> \&.\|.\|.

source: B<lexgrog> is an implementation of the traditional \(lqgroff guess\(rq utility in B<lex>. It reads the list of files on its command line as either man page source files or preformatted \(lqcat\(rq pages, and displays their name and description as used by B<apropos> and B<whatis>, the list of preprocessing filters required by the man page before it is passed to B<nroff> or B<troff>, or both.
id: B<lexgrog> adalah sebuah implementasi dari tradisional utiliti \(lqgroff guess\(rq dalam B<lex>. Ini membaca daftar dari berkas dalam baris perintahnya baik sebagai halaman manual sumber berkas atau preformatted \(lqcat\(rq pages, dan menampilkan nama dan deskripsinya seperti biasa digunakan oleh B<apropos> dan B<whatis>, daftar dari preprosesing penyaring dibutuhkan oleh halaman manual sebelum ini dilewatkan ke B<nroff> atau B<troff>, atau keduanya.

source: If its input is badly formatted, B<lexgrog> will print \(lqparse failed\(rq; this may be useful for external programs that need to check man pages for correctness. If one of B<lexgrog>'s input files is \(lq-\(rq, it will read from standard input; if any input file is compressed, a decompressed version will be read automatically.
id: Jika masukannya adalah terformat buruk, B<lexgrog> akan menampilkan \lqparse failed\(rq; ini mungkin berguna untuk program eksternal yang butuh pemeriksaan halaman manual untuk pembenaran. Jika satu dari B<lexgrog> berkas masukan adalah \(lq-\(rq, ini akan dibaca dari standar masukan; jika berkas masukan apapun dikompress, sebuah versi tidak terkompress akan dibaca secara otomatis.

source: Parse input as man page source files. This is the default if neither B<--man> nor B<--cat> is given.
id: Parse masukan sebagai berkas sumber halaman manual. Ini adalah baku jika bukan B<--man> ataupun B<--cat> diberikan.

source: Parse input as preformatted man pages (\(lqcat pages\(rq). B<--man> and B<--cat> may not be given simultaneously.
id: Parse masukan sebagai halaman manual terformat (\(lqcat pages\(rq). B<--man> dan B<--cat> mungkin tidak diberikan secara bersamaan.

source: Display the name and description from the man page's header, as used by B<apropos> and B<whatis>. This is the default if neither B<--whatis> nor B<--filters> is given.
id: Tampilkan nama dan deskripsi dari header halaman manual, seperti digunakan oleh B<apropos> dan B<whatis>. Ini adalah baku jika bukan B<--whatis> ataupun B<--filters> diberikan.

source: Display the list of filters needed to preprocess the man page before formatting with B<nroff> or B<troff>.
id: Tampilkan daftar dari penyaring yang dibutuhkan untuk preproses halaman manual sebelum memformatnya dengan B<nroff> atau B<troff>.

source: Override the guessed character set for the page to I<encoding>.
id: Override set karakter yang diterka untuk halaman ke I<encoding>.

source: Usage error.
id: Penggunaan error.

source: B<lexgrog> failed to parse one or more of its input files.
id: B<lexgrog> gagal untuk parse satu atau lebih dari berkas masukannya.

source: EXAMPLES
id: CONTOH

source: $ lexgrog man.1 man.1: "man - an interface to the on-line reference manuals" $ lexgrog -fw man.1 man.1 (t): "man - an interface to the on-line reference manuals" $ lexgrog -c whatis.cat1 whatis.cat1: "whatis - display manual page descriptions" $ lexgrog broken.1 broken.1: parse failed
id: $ lexgrog man.1 man.1: "man - sebuah antar-muka ke referensi manual on-line" $ lexgrog -fw man.1 man.1 (t): "man - sebuah antar-muka ke referensi manual on-line" $ lexgrog -c whatis.cat1 whatis.cat1: "whatis - menampilkan deskripsi halaman manual" $ lexgrog broken.1 broken.1: parse gagal

source: B<%mandb%> (which uses the same code as B<lexgrog>) parses the B<NAME> section at the top of each manual page looking for names and descriptions of the features documented in each. While the parser is quite tolerant, as it has to cope with a number of different forms that have historically been used, it may sometimes fail to extract the required information.
id: B<%mandb%> (yang menggunakan kode sama seperti B<lexgrog>) parses B<NAMA> bagian di puncak dari setiap halaman manual mencari untuk nama dan deskripsi dari features yang didokumentasikan. Ketika parser quite tolerant, sama seperti memiliki cope dengan sebuah angka dari bentuk berbeda yang memiliki secara sejarah telah digunakan, ini mungkin beberapa kali gagal untuk mengekstrak informasi yang dibutuhkan.

source: When using the traditional I<man> macro set, a correct B<NAME> section looks something like this:
id: Ketika menggunakan tradisional I<man> makro set, sebuah bagian benar B<NAMA> tampak seperti ini:

source: CW<\&.SH NAME foo \e- program to do something>
id: CW<\&.SH NAMA foo \e- program untuk melakukan sesuatu>

source: Some manual pagers require the \(oq\e-\(cq to be exactly as shown; B<%mandb%> is more tolerant, but for compatibility with other systems it is nevertheless a good idea to retain the backslash.
id: Beberapa halaman manual membutuhkan \(oq\e-\(cq untuk secara tepat terlihat; B<%mandb%> yang lebih tolerant, tetapi untuk kompabilitas dengan sistem lain ini mungkin sebuah ide bagus untuk menjaga backslash.

source: On the left-hand side, there may be several names, separated by commas. Names containing whitespace will be ignored to avoid pathological behaviour on certain ill-formed B<NAME> sections. The text on the right-hand side is free-form, and may be spread over multiple lines. If several features with different descriptions are being documented in the same manual page, the following form is therefore used:
id: Di sisi tangan-kiri, disana mungkin ada beberapa nama, dipisahkan dengan koma.Nama berisi spasi akan diabaikan untuk menghindari perilaku pathologikal di beberapa bagian terbentuk buruk B<NAME>. Teks di sisi sebelah kanan adalah bebas bentuk, dan mungkin dipisahkan diatas beberapa baris. Jika beberapa feature dengan beberapa deskripsi sedang didokumentasikan dalam halaman manual yang sama, form berikut akan digunakan:

source: CW<\&.SH NAME foo, bar \e- programs to do something \&.br baz \e- program to do nothing>
id: CW<\&.SH NAMA foo, bar \e- aplikasi untuk melakukan sesuatu \&.br baz \e- aplikasi tidak melakukan apapun>

source: (A macro which starts a new paragraph, like CW<.PP>, may be used instead of the break macro CW<.br>.)
id: (Sebuah makro yang memulai sebuah paragraph baru, seperti CW<.PP>, mungkin digunakan daripada makro break CW<.br>.)

source: When using the BSD-derived I<mdoc> macro set, a correct B<NAME> section looks something like this:
id: Ketika menggunakan BSD-derived I<mdoc> makro set, sebuah bagian B<NAMA> benarmungkin kelihatan seperti ini:

source: CW<\&.Sh NAME \&.Nm foo \&.Nd program to do something>
id: CW<\&.Sh NAMA \&.Nm foo \&.Nd aplikasi untuk melakukan sesuatu>

source: There are several common reasons why whatis parsing fails. Sometimes authors of manual pages replace \(oq.SH NAME\(cq with \(oq.SH MYPROGRAM\(cq, and then B<%mandb%> cannot find the section from which to extract the information it needs. Sometimes authors include a NAME section, but place free-form text there rather than \(oqname \e- description\(cq. However, any syntax resembling the above should be accepted.
id: Disana ada beberapa alasan umum kenapa parsing whatis gagal. Kadang kadang pengarang dari halaman manual mengganti \(oq.SH NAME\(cq dengan \(oq.SH MYPROGRAM\(cq, dan kemundian B<%mandb%> tidak dapat menemukan bagian dari itu untuk mengekstrak informasi yang dibutuhkan. Kadang kala pengarang memasukan sebuah bagian NAMA, tetapi menempatkan teks bebas bentuk disana daripada \(oqname \e- deskripsi\cq. Kesimpulannya, sintaks apapun yang menyerupai diatas seharusnya diterima.

source: NOTES
id: CATATAN

source: B<lexgrog> attempts to parse files containing .so requests, but will only be able to do so correctly if the files are properly installed in a manual page hierarchy.
id: B<lexgrog> mencoba menparse berkas berisi .so diminta, tetapi hanya akan dapat melakukan itu dengan benar jika berkas secara benar terpasang di struktur halaman manual.

source: The code used by B<lexgrog> to scan man pages was written by:
id: Kode digunakan oleh B<lexgrog> untuk menscan halaman manual telah ditulis oleh:

source: Colin Watson wrote the current incarnation of the command-line front-end, as well as this man page.
id: Colin Watson menulis pembentukan dari front-end baris perintah sekarang, dan juga halaman manual ini.

source: %man% - an interface to the on-line reference manuals
id: %man% - sebuah antar-muka ke referensi manual online

source: B<%man%> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<warnings>\|]\|] [\|B<-R> I<encoding>\|] [\|B<-L> I<locale>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-S> I<list>\|] [\|B<-e> I<extension>\|] [\|B<-i>\||\|B<-I>\|] [\|B<-a>\|] [\|B<-u>\|] [\|B<-P> I<pager>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<encoding>\|] [\|B<-p> I<string>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<device>\|]\|] [\|B<-H>\|[\|I<browser>\|]\|] [\|B<-X>\|[\|I<dpi>\|]\|] [\|B<-Z>\|] [\|[\|I<section>\|] I<page>\ .\|.\|.\|]\ .\|.\|.
id: B<%man%> [\|B<-C> I<berkas>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<peringatan>\|]\|] [\|B<-R> I<pengkodean>\|] [\|B<-L> I<lokal>\|] [\|B<-m> I<sistem>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<jalur>\|] [\|B<-S> I<daftar>\|] [\|B<-e> I<ekstensi>\|] [\|B<-i>\||\|B<-I>\|] [\|B<-a>\|] [\|B<-u>\|] [\|B<-P> I<pager>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<pengkodean>\|] [\|B<-p> I<string>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<perangkat>\|]\|] [\|B<-H>\|[\|I<browser>\|]\|] [\|B<-X>\|[\|I<dpi>\|]\|] [\|B<-Z>\|] [\|[\|I<bagian>\|] I<halaman>\ .\|.\|.\|]\ .\|.\|.

source: B<%man%> B<-k> [\|I<apropos> I<options>\|] I<regexp> \&.\|.\|.
id: B<%man%> B<-k> [\|I<apropos> I<opsi>\|] I<regexp> \&.\|.\|.

source: B<%man%> B<-f> [\|I<whatis> I<options>\|] I<page> \&.\|.\|.
id: B<%man%> B<-f> [\|I<whatis> I<opsi>\|] I<halaman> \&.\|.\|.

source: B<%man%> B<-l> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<warnings>\|]\|] [\|B<-R> I<encoding>\|] [\|B<-L> I<locale>\|] [\|B<-P> I<pager>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<encoding>\|] [\|B<-p> I<string>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<device>\|]\|] [\|B<-H>\|[\|I<browser>\|]\|] [\|B<-X>\|[\|I<dpi>\|]\|] [\|B<-Z>\|] I<file> \&.\|.\|.
id: B<%man%> B<-l> [\|B<-C> I<berkas>\|] [\|B<-d>\|] [\|B<-D>\|] [\|B<--warnings>\|[\|=I<peringatan>\|]\|] [\|B<-R> I<pengkodean>\|] [\|B<-L> I<lokal>\|] [\|B<-P> I<pager>\|] [\|B<-r> I<prompt>\|] [\|B<-7>\|] [\|B<-E> I<pengkodean>\|] [\|B<-p> I<string>\|] [\|B<-t>\|] [\|B<-T>\|[\|I<perangkat>\|]\|] [\|B<-H>\|[\|I<browser>\|]\|] [\|B<-X>\|[\|I<dpi>\|]\|] [\|B<-Z>\|] I<berkas> \&.\|.\|.

source: B<%man%> B<-w>\||\|B<-W> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] I<page> \&.\|.\|.
id: B<%man%> B<-w>\||\|B<-W> [\|B<-C> I<berkas>\|] [\|B<-d>\|] [\|B<-D>\|] I<halaman> \&.\|.\|.

source: B<%man%> B<-c> [\|B<-C> I<file>\|] [\|B<-d>\|] [\|B<-D>\|] I<page> \&.\|.\|.
id: B<%man%> B<-c> [\|B<-C> I<berkas>\|] [\|B<-d>\|] [\|B<-D>\|] I<halaman> \&.\|.\|.

source: B<%man%> is the system's manual pager. Each I<page> argument given to B<%man%> is normally the name of a program, utility or function. The I<manual page> associated with each of these arguments is then found and displayed. A I<section>, if provided, will direct B<%man%> to look only in that I<section> of the manual. The default action is to search in all of the available I<sections>, following a pre-defined order and to show only the first I<page> found, even if I<page> exists in several I<sections>.
id: B<%man%> adalah halaman manual sistem. Setiap I<halaman> argumen diberikan ke B<%man%> adalah normalnya nama dari sebuah aplikasi, utility atau fungsi. I<halaman manual> yang berasosiasi dengan setiap dari argumen ini kemudian ditemukan dan ditampilkan. Sebuah I<bagian>, jika disediakan, akan mendireksi B<%man%> untuk hanya melihat dalam I<bagian> dari manual. Aksi default adalah untuk mencari dalam semua dari I<bagian> yang tersedia, mengikuti sebuah urutan yang telah didefinisikan dan hanya memperlihatkan I<halaman> pertama yang ditemukan, bahkan jika I<halaman> telah ada dalam beberapa I<bagian>.

source: The table below shows the I<section> numbers of the manual followed by the types of pages they contain.
id: Tabel dibawah memperlihatkan I<bagian> jumlah dari manual diikuti oleh tipe dari halaman yang mereka isi.
