Repository: Distrotech/man-db
Catalog: man/po4a/po/*.po
Languages: id

source: B<%catman%> is used to create an up to date set of pre-formatted manual pages known as cat pages. Cat pages are generally much faster to display than the original manual pages, but require extra storage space. The decision to support cat pages is that of the local administrator, who must provide suitable directories to contain them.
id: B<%catman%> digunakan untuk membuat sebuah update set dari preformat halaman manual dikenal sebagai halaman cat. Halaman cat secara umum lebih cepat untuk menampilkan daripada halaman manual asli, tetapi membutuhkan ruang penyimpanan ekstra. Keputusan untuk mendukung halaman cat berada di administrator lokal, yang harus memberikan direktori yang sesuai untuk itu.

source: The options available to B<%catman%> are the manual page hierarchies and sections to pre-format. The default hierarchies are those specified as system hierarchies in the man-db configuration file, and the default sections are either the colon-delimited contents of the environment variable $B<MANSECT> or the standard set compiled into B<%man%> if $B<MANSECT> is undefined. Supplying B<%catman%> with a set of whitespace-delimited section names will override both of the above.
id: Opsi tersedia ke B<%catman%> adalah hierarki halaman manual dan bagian untuk preformat. Hierarki baku yang dispesifikasikan sebagai hierarki sistem dalam berkas konfigurasi man-db, dan bagian baku baik isi dipisahkan kolon dari variabel lingkungan $B<MANSECT> atau set standar dikompile kedalam B<%man%> jika $B<MANSECT> tidak terdefinisi. Diberikan B<%catman%> dengan sebuah set dari bagian nama dipisahkan spasi override kedua diatas.

source: B<%catman%> makes use of the B<index> database cache associated with each hierarchy to determine which files need to be formatted.
id: B<%catman%> membuat penggunaan dari B<indeks> basis data cache diasosiasikan dengan setiap hierarki untuk menentukan berkas mana dibutuhkan untuk diformat.

source: Specify an alternate colon-delimited manual page hierarchy search path. By default, this is all paths indicated as system hierarchies in the man-db configuration file.
id: Spesifikasikan sebuah jalur pencarian alternatif hierarki halaman manual dipisahkan kolon. Secara baku, jalur semua ini mengindikasikan sebagai hierarki sistem dalam berkas konfigurasi man-db.

source: An alternate or FSSTND compliant global I<index> database cache.
id: Sebuah alternatif atau FSSTND komplian global I<indeks> basis data cache.

source: %mandb% - create or update the manual page index caches
id: %mandb% - buat atau update indeks cache halaman manual

source: B<%mandb%> [\|B<-dqsucpt>\||\|B<-h>\||\|B<-V>\|] [\|B<-C> I<file>\|] [\|I<manpath>\|]
id: B<%mandb%> [\|B<-dqsucpt>\||\|B<-h>\||\|B<-V>\|] [\|B<-C> I<berkas>\|] [\|I<jalurman>\|]

source: B<%mandb%> [\|B<-dqsut>\|] [\|B<-C> I<file>\|] B<-f> I<filename>\ .\|.\|.
id: B<%mandb%> [\|B<-dqsut>\|] [\|B<-C> I<berkas>\|] B<-f> I<nama berkas>\ .\|.\|.

source: B<%mandb%> is used to initialise or manually update B<index> database caches that are usually maintained by B<%man%>. The caches contain information relevant to the current state of the manual page system and the information stored within them is used by the man-db utilities to enhance their speed and functionality.
id: B<%mandb%> digunakan untuk menginisialisasi atau secara manual mengupdate basis data cache B<indeks> yang biasanya dipelihara oleh B<%man%>. Cache berisi informasi relevan ke kondisi sekaran dari sistem halaman manual dan informasi disimpan didalamanya digunakan oleh perangkat man-db untuk meningkatkan kecepatannya dan fungsionalitasnya.

source: When creating or updating an B<index>, B<%mandb%> will warn of bad ROFF .so requests, bogus manual page filenames and manual pages from which the B<whatis> cannot be parsed.
id: Ketika membuat atau mengupdate sebuah B<indeks>, B<%mandb%> akan memperingatkan dari permintaan buruk .so ROFF, nama berkas halaman manual palsu dan halaman manual dari B<whatis> tidak dapat diparse.

source: Supplying B<%mandb%> with an optional colon-delimited path will override the internal system manual page hierarchy search path, determined from information found within the man-db configuration file.
id: Memberikan B<%mandb%> dengan sebuah opsional jalur dipisahkan kolon akan memaksa jalur pencarian internal hierarki sistem halaman manual, ditentukan dari informasi ditemukan didalam berkas konfigurasi man-db.

source: DATABASE CACHES
id: CACHE BASIS DATA

source: B<%mandb%> can be compiled with support for any one of the following database types.
id: B<%mandb%> dapat dikompile dengan dukungan untuk tipe basis data apapun berikut ini.

source: Name@Type@Async@Filename
id: Nama@Tipe@Async@Namaberkas

source: Berkeley db@Binary tree@Yes@I<index.bt>
id: Berkeley db@Binari tree@Yes@I<index.bt>

source: Those database types that support asynchronous updates provide enhanced speed at the cost of possible corruption in the event of unusual termination. In an unusual case where this has occurred, it may be necessary to rerun B<%mandb%> with the B<-c> option to re-create the databases from scratch.
id: Tipe basis data itu yang mendukung update asinkron memberikan kecepatan lebih dengan kemungkinan korupsi pada saat dari terminasi tidak biasa. Dalam kasus tidak bisa dimana ini telah terjadi, ini mungkin perlu untuk menjalankan ulan B<%mandb%> dengan opsi B<-c> untuk membuat kembali basis data dari pecahan.

source: Produce no warnings.
id: Tidak menghasilkan peringatan.

source: Do not spend time looking for or adding information to the databases regarding stray cats.
id: Jangan habiskan waktu mencari untuk atau menambahkan informasi ke basis data mempertimbangkan stray cats.

source: Do not spend time checking for deleted manual pages and purging them from the databases.
id: Jangan habiskan waktu memeriksa untuk halaman manual terhapus dan hapus mereka dari basis data.

source: By default, B<%mandb%> will try to update any previously created databases. If a database does not exist, it will create it. This option forces B<%mandb%> to delete previous databases and re-create them from scratch, and implies B<--no-purge.> This may be necessary if a database becomes corrupt or if a new database storage scheme is introduced in the future.
id: Secara baku, B<%mandb%> akan mencoba mengupdate basis data yang dibuat sebelumnya. Jika sebuah basis data tidak ada, ini akan dibuat. Opsi ini memaksa B<%mandb%> untuk menghapus basis data sebelumnya dan membuat kembali dari pecahan, dan mengimplikasikan B<--no-purge.> Ini mungkin diperlukan jika sebuah basis data menjadi terkorupsi atau jika sebuah skema penyimpanan basis data baru dikenalkan dalam masa depan.

source: Create user databases only, even with write permissions necessary to create system databases.
id: Buat basis dapat pengguna saja, walaupun dengan ijin tulis dibutuhkan untuk membuat basis data sistem.

source: Perform correctness checks on manual pages in the hierarchy search path. With this option, B<%mandb%> will not alter existing databases.
id: Lakukan pemeriksaan kebenaran di halaman manual dalam hierarki jalur pencarian. Dengan opsi ini, B<%mandb%> tidak akan mengubah basis data yang sudah ada.

source: Update only the entries for the given filename. This option is not for general use; it is used internally by B<%man%> when it has been compiled with the B<MAN_DB_UPDATES> option and finds that a page is out of date. It implies B<-p> and disables B<-c> and B<-s>.
id: Hanya update masukan dari nama berkas yang diberikan. Opsi ini tidak untuk penggunaan umum; ini digunakan secara internal oleh B<%man%> ketika ini telah dikompile dengan B<MAN_DB_UPDATES> opsi dan menemukan bahwa sebuah halaman telah kadaluarsa. Ini mengimplikasikan B<-p> dan menonaktifkan B<-c> dan B<-s>.

source: Show the usage message, then exit.
id: Tampilkan pesan penggunaan, kemudian keluar.

source: Show the version, then exit.
id: Tampilkan versi, kemudian keluar.

source: Usage, syntax, or configuration file error.
id: Penggunaan, sintaks, atau berkas konfigurasi error.

source: A child process failed.
id: Sebuah proses anak gagal.

source: DIAGNOSTICS
id: DIAGNOSA

source: The following warning messages can be emitted during database building.
id: Pesan peringatan berikut dapat dikeluarkan selama pembuatan basis data.

source: B<E<lt>filenameE<gt>: whatis parse for page(sec) failed>
id: B<E<lt>nama berkasE<gt>: whatis parse untuk halaman(sec) gagal>

source: An attempt to extract whatis line(s) from the given E<lt>filenameE<gt> failed. This is usually due to a poorly written manual page, but if many such messages are emitted it is likely that the system contains non-standard manual pages which are incompatible with the man-db whatis parser. See the B<WHATIS PARSING> section in B<lexgrog>(1) for more information.
id: Sebuah percobaan untuk mengekstrak baris whatis E<lt>dari nama berkasE<gt> yang diberikan gagal. Ini biasanya karena halaman manual yang ditulis kurang lengkap, tetapi jika banyak pesan seperti itu yang dikeluarkan sepertinya sistem berisi halaman manual yang tidak standar yang tidak kompatibel dengan man-db whatis parser. Lihat bagian B<WHATIS PARSING> dalam B<lexgrog>(1) untuk informasi lebih lanjut.

source: B<E<lt>filenameE<gt>: is a dangling symlink>
id: B<E<lt>nama berkasE<gt>: adlaah sebuah simlink dangling>

source: E<lt>filenameE<gt> does not exist but is referenced by a symbolic link. Further diagnostics are usually emitted to identify the E<lt>filenameE<gt> of the offending link.
id: E<lt>nama berkasE<gt> tidak ada tetapi direferensikan oleh sebuah link simbolik. Diagnosa lebih lanjut biasanya dikeluarkan untuk mengidentifikasikan E<lt>nama berkasE<gt> dari offending link.

source: B<E<lt>filenameE<gt>: bad symlink or ROFF `.so' request>
id: B<E<lt>nama berkasE<gt>: symlink buruk atau permintaan `.so' ROFF>

source: E<lt>filenameE<gt> is either a symbolic link to, or contains a ROFF include request to, a non existent file.
id: E<lt>nama berkasE<gt> baik sebuak link simbolik ke, atau berisi sebuah ROFF termasuk permintaan ke, sebuah berkas yang tidak ada.

source: B<E<lt>filenameE<gt>: ignoring bogus filename>
id: B<E<lt>nama berkasE<gt>: mengabaikan nama berkas palsu>

source: The E<lt>filenameE<gt> may or may not be a valid manual page but its name is invalid. This is usually due to a manual page with sectional extension E<lt>xE<gt> being put in manual page section E<lt>yE<gt>.
id: E<lt>nama berkasE<gt> mungkin atau tidak mungkin berupa sebuah halaman manual normal tetapi namanya tidak valid. Ini biasanya karena sebuah halaman manual dengan ekstensi bagian E<lt>xE<gt> diletakan dalam bagian halaman manual E<lt>yE<gt>.

source: B<E<lt>filename_maskE<gt>: competing extensions>
id: B<E<lt>filename_maskE<gt>: ekstensi berkompetensi>

source: The wildcard E<lt>filename_maskE<gt> is not unique. This is usually caused by the existence of both a compressed and uncompressed version of the same manual page. All but the most recent are ignored.
id: Wildcard E<lt>filename_maskE<gt> tidak unik. Ini biasanya disebabkan oleh adanya baik versi terkompres dan tidak terkompres dari halaman manual yang sama. Seluruh tetapi yang paling baru diabaikan.

source: The B<WHATIS PARSING> section formerly in this manual page is now part of B<lexgrog>(1).
id: B<WHATIS PARSING> bagian sebelumnya dalam halaman manual ini sekarang bagian dari B<lexgrog>(1).
