Repository: Distrotech/man-db
Catalog: man/po4a/po/*.po
Languages: id

source: 1@Executable programs or shell commands
id: 1@Executable aplikasi atau perintah shell

source: 2@System calls (functions provided by the kernel)
id: 2@Panggilan sistem (fungsi yang disediakan oleh kernel)

source: 3@Library calls (functions within program libraries)
id: 3@Panggilan perpustakaan (fungsi yang ada dalam perpustakaan aplikasi)

source: 4@Special files (usually found in I</dev>)
id: 4@Berkas spesial (biasanya ditemukan dalam I</dev>

source: 5@File formats and conventions eg I</etc/passwd>
id: 5@Format berkas dan konvensi contoh I</etc/passwd>

source: 6@Games
id: 6@Permainan

source: Miscellaneous (including macro packages and conventions),
id: Miscellaneous (termasuk paket makro dan konvensi),

source: 8@System administration commands (usually only for root)
id: 8@Perintah administrasi sistem (biasanya hanya untuk root)

source: 9@Kernel routines [\|Non standard\|]
id: 9@Rutinitas kernel [\|Bukan standar\|]

source: A manual I<page> consists of several sections.
id: Sebuah I<halaman> manual terdiri dari beberapa bagian.

source: Conventional section names include B<NAME>, B<SYNOPSIS>, B<CONFIGURATION>, B<DESCRIPTION>, B<OPTIONS>, B<EXIT\ STATUS>, B<RETURN\ VALUE>, B<ERRORS>, B<ENVIRONMENT>, B<FILES>, B<VERSIONS>, B<CONFORMING\ TO>, B<NOTES>, B<BUGS>, B<EXAMPLE>, B<AUTHORS>, and B<SEE\ ALSO>.
id: Nama konvensional termasuk B<NAMA>, B<SINOPSIS>, B<KONFIGURASI>, B<DESKRIPSI>, B<OPSI>, B<STATUS\ KELUAR>, B<NILAI\ KEMBALI>, B<ERRORS>, B<LINGKUNGAN>, B<BERKAS>, B<VERSI>, B<KONFORM\ KE>, B<CATATAN>, B<BUGS>, B<CONTOH>, B<PENGARANG>, dan B<LIHAT\ JUGA>.

source: The following conventions apply to the B<SYNOPSIS> section and can be used as a guide in other sections.
id: Konvensi berikut juga berlaku ke bagian B<SINOPSIS> dan dapat digunakan sebagai panduan dalam daerah lain.

source: B<bold text>@type exactly as shown.
id: B<teks tebal>@ketik tepat seperti yang terlihat.

source: I<italic text>@replace with appropriate argument.
id: I<teks miring>@ganti dengan approriate argumen.

source: [\|B<-abc>\|]@any or all arguments within [ ] are optional.
id: [\|B<-abc>\|]@apapun atau seluruh argumen didalam [ ] adalah opsional.

source: B<-a\|>|\|B<-b>@options delimited by | cannot be used together.
id: B<-a\|>|\|B<-b>@opsi dipisahkan oleh | tidak dapat digunakan bersama.

source: I<argument>B< .\|.\|.@>I<argument> is repeatable.
id: I<argument>B< .\|.\|.@>I<argument> adalah dapat diulang.

source: [\|I<expression>\|]B< .\|.\|.@>entire I<expression>\ within [ ] is repeatable.
id: [\|I<ekspresi>\|]B< .\|.\|.@>seluruh I<ekspresi>\ didalam [ ] adalah dapat diulang.

source: The command or function illustration is a pattern that should match all possible invocations. In some cases it is advisable to illustrate several exclusive invocations as is shown in the B<SYNOPSIS> section of this manual page.
id: Perintah atau ilustrasi fungsi adalah sebuah pola yang seharusnya cocok dengan seluruh kemungkinan pemanggilan. Dalam beberapa kasus ini dapat disarankan untuk mengilustrasikan beberapa pemanggilan ekslusif seperti terlihat dalam bagian B<SINOPSIS> dari halaman manual ini.

source: Display the manual page for the I<item> (program) I<ls>.
id: Tampilkan halaman manual untuk (aplikasi) I<item> I<ls>.

source: Display, in succession, all of the available I<intro> manual pages contained within the manual. It is possible to quit between successive displays or skip any of them.
id: Tampilkan, dalam suksesi, seluruh dari I<intro> halaman manual yang tersedia yang berada dalam manual. Jika memungkinkan berhenti diantara penampilkan atau lewati beberapa dari itu.

source: Format the manual page referenced by `I<alias>', usually a shell manual page, into the default B<troff> or B<groff> format and pipe it to the printer named I<ps>. The default output for B<groff> is usually PostScript. B<%man% --help> should advise as to which processor is bound to the B<-t> option.
id: Format halaman manual direferensikan oleh `I<alias>', biasanya sebuah halaman manual shell, kedalam baku B<troff> atau B<groff> format dan pipe itu ke pencetak bernama I<ps>. Keluaran baku untuk B<groff> biasanya PostScript. B<%man% --help> seharusnya disarankan prosesor mana yang terikat ke opsi B<-t>.

source: This command will decompress and format the nroff source manual page I<./foo.1x.gz> into a B<device independent (dvi)> file. The redirection is necessary as the B<-T> flag causes output to be directed to B<stdout> with no pager. The output could be viewed with a program such as B<xdvi> or further processed into PostScript using a program such as B<dvips.>
id: Perintah ini akan mendekompres dan format sumber halaman manual nroff I<./foo.1x.gz> kedalam sebuah B<perangkat independent (dvi)> berkas. Redireksi diperlukan karena B<-T> flag menyebabkan keluaran untuk diarahkan ke B<stdout> dengan tidak ada pager. Keluaran akan dilihat dengan sebuah aplikasi seperti B<xdvi> atau pemrosesan lebih lanjut kedalam PostScript menggunakan sebuah aplikasi seperti B<dvips.>

source: Search the short descriptions and manual page names for the keyword I<printf> as regular expression. Print out any matches. Equivalent to B<%apropos%\ -r>I<\ printf>B<.>
id: Cari deskripsi singkat dan nama halaman manual untuk kata kunci I<printf> seperti ekspresi regular. Cetak semua kecocokan. Sama dengan B<%apropos%\ -r>I<\ printf>B<.>

source: Lookup the manual pages referenced by I<smail> and print out the short descriptions of any found. Equivalent to B<%whatis%\ -r>I<\ smail>B<.>
id: Cari halaman manual direferensikan oleh I<smail> dan tampilkan deskripsi singkat dari apapun yang ditemukan. Sama dengan B<%whatis%\ -r>I<\ smail>B<.>

source: Many options are available to B<%man%> in order to give as much flexibility as possible to the user. Changes can be made to the search path, section order, output processor, and other behaviours and operations detailed below.
id: Banyak opsi tersedia ke B<%man> dengan tujuan untuk memberikan lebih banyak fleksibilitas sebanyak mungkin ke pengguna. Perubahan dapat dibuat di jalur pencarian, bagian pengurutan, prosesor keluaran, dan perilaku lain dan operasi detail dibawah.

source: If set, various environment variables are interrogated to determine the operation of B<%man%>. It is possible to set the `catch all' variable $B<MANOPT> to any string in command line format with the exception that any spaces used as part of an option's argument must be escaped (preceded by a backslash). B<%man%> will parse $B<MANOPT> prior to parsing its own command line. Those options requiring an argument will be overridden by the same options found on the command line. To reset all of the options set in $B<MANOPT>, B<-D> can be specified as the initial command line option. This will allow %man% to `forget' about the options specified in $B<MANOPT> although they must still have been valid.
id: Jika diset, berbagai variabel lingkungan diinterogerasi untuk menentukan operasi dari B<%man%>. Ini memungkinkan untuk menset variabel `catch all' $B<MANOPT> ke string apapun dalam format baris perintah dengan eksepsi bahwa spasi apapun yang digunakan sebagai bagian dari sebuah opsi argumen harus diescape (diawali oleh sebuah backslash). B<%man%> akan parse $B<MANOPT>sebelum parsing baris perintahnya sendiri. Opsi ini membutuhkan sebuah argumen yang akan di override dengan opsi yang sama yang ditemukan di baris perintah. UNtuk mereset seluruh set opsi dalam $B<MANOPT>, B<-D> dapat dispesifikasikan sebagai opsi baris perintah inisial. Ini akan mengijinkan %man% untuk `forget' mengenai opsi yang dispesifikasikan dalam $B<MANOPT> walaupun mereka tetap harus valid.

source: The manual pager utilities packaged as B<man-db> make extensive use of B<index> database caches. These caches contain information such as where each manual page can be found on the filesystem and what its I<whatis> (short one line description of the man page) contains, and allow B<%man%> to run faster than if it had to search the filesystem each time to find the appropriate manual page. If requested using the B<-u> option, B<man> will ensure that the caches remain consistent, which can obviate the need to manually run software to update traditional I<whatis> text databases.
id: Utiliti manual pager dipaket sebagai B<man-db> membuat penggunaan ekstensif dari B<index> database caches. Cache ini berisi informasi seperti dimana setiap halaman manual dapat ditemukan di sistem berkas dan apakah ini I<whatis> (deskripsi satu baris pendek dari halaman manual) isi, dan mengijinkan B<man> untuk berjalan lebih cepat daripada jika iini harus mencaris sistem berkas setiap waktu untuk menemukan halaman manual yang sesuai. Jika diminta menggunakan opsi B<-u>, B<man> akan memastikan cache tetap konsisten, yang dapat mengobviate kebutuhan untuk menjalankan aplikasi secara manual untuk mengupdate basis data teks tradisional I<whatis>.

source: If B<%man%> cannot find a B<%mandb%> initiated B<index> database for a particular manual page hierarchy, it will still search for the requested manual pages, although file globbing will be necessary to search within that hierarchy. If B<%whatis%> or B<%apropos%> fails to find an B<index> it will try to extract information from a traditional I<whatis> database instead.
id: Jika B<%man%> tidak dapat menemukan sebuah B<%mandb> diinisiasikan B<index> basis data untuk sebuah struktur halaman manual tertentuk, ini akan tetap mencari untuk halaman manual yang diminta, walaupun berkas globbing akan tetap dibutuhkan untuk mencari didalam struktur. Jika B<%whatis%> atau B<%apropos%> gagal untuk menemukan sebuah B<index> ini akan mencoba untuk mengekstrak informasi dari sebuah basis data tradisional I<whatis>.

source: These utilities support compressed source nroff files having, by default, the extensions of B<.Z>, B<.z> and B<.gz>. It is possible to deal with any compression extension, but this information must be known at compile time. Also, by default, any cat pages produced are compressed using B<gzip>. Each `global' manual page hierarchy such as I</usr/share/man> or I</usr/X11R6/man> may have any directory as its cat page hierarchy. Traditionally the cat pages are stored under the same hierarchy as the man pages, but for reasons such as those specified in the B<File Hierarchy Standard (FHS)>, it may be better to store them elsewhere. For details on how to do this, please read B<manpath>(5). For details on why to do this, read the standard.
id: Utiliti ini mendukung kompressed berkas sumber nroff, secara baku, ekstensi dari B<.Z>, B<.z> dan B<.gz>. Ini memungkinkan untuk menghadapi dengan ekstensi kompresi apapun, tetapi informasi ini harus diketahui di waktu kompile. Juga, secara baku, halaman cat apapun dihasilkan adalah dikompress menggunakan B<gzip>. Setiap `global' halaman manual hierarchy seperti I</usr/share/man> atau I</usr/X11R6/man> mungkin memiliki direktori apapun seperti struktur halaman cat nya. Secara tradisional halaman cat disimpan dibawah struktur yang sama seperti halaman manual, tetapi untuk beberapa alasan seperti yang dispesifikasikan dalam B<Struktur Berkas Standar (FHS)>, ini mungkin lebih baik menyimpannya ditempat lain. Untuk lebih detailnya bagaimana melakukan ini, mohon baca B<manpath>(5). Untuk lebih detailnya kenapa melakukan hal ini, baca standar.

source: International support is available with this package. Native language manual pages are accessible (if available on your system) via use of I<locale> functions. To activate such support, it is necessary to set either $B<LC_MESSAGES>, $B<LANG> or another system dependent environment variable to your language locale, usually specified in the B<POSIX 1003.1> based format:
id: Dukungan internasional tersedia dalam paket ini. Bahasa lokal halaman manual dapat diakses (jika tersedia melalui sistem anda) melalui penggunaan dari fungsi I<locale>. Untuk mengaktifkan dukungan seperti itu, ini diperlukan untuk menset baik $B<LC_MESSAGES>, $B<LANG> atau variabel sistem yang tergantung lainnya ke lokal bahasa anda, biasanya dispesifikasikan dalam dasar format B<POSIX 1003.1>:

source: E<lt>I<language>E<gt>[\|B<_>E<lt>I<territory>E<gt>\|[\|B<.>E<lt>I<character-set>E<gt>\|[\|B<,>E<lt>I<version>E<gt>\|]\|]\|]
id: E<lt>I<language>E<gt>[\|B<_>E<lt>I<territory>E<gt>\|[\|B<.>E<lt>I<set karakter>E<gt>\|[\|B<,>E<lt>I<versi>E<gt>\|]\|]\|]

source: If the desired page is available in your I<locale>, it will be displayed in lieu of the standard (usually American English) page.
id: Jika halaman yang diiginkan tersedia dalam I<local> anda, ini akan ditampilkan seketika dari halaman (biasanya Bahasa Inggris Amerika) standar.

source: Support for international message catalogues is also featured in this package and can be activated in the same way, again if available. If you find that the manual pages and message catalogues supplied with this package are not available in your native language and you would like to supply them, please contact the maintainer who will be coordinating such activity.
id: Dukungan untuk pesan internasional katalog juga difeature dalam paket ini dan dapat diaktivasikan dalam cara sama, kembali jika tersedia. Anda menemukan halaman manual dan pesan katalog diberikan dengan paket ini tidak tersedia dalam bahasa lokal dan anda ingin mensuplinya, hubungi maintainer yang akan mengkoordinasi aktivitas seperti itu.

source: For information regarding other features and extensions available with this manual pager, please read the documents supplied with the package.
id: Untuk informasi mengenai featur lain dan ekstensi yang tersedia dengan halaman manual, mohon baca dokumen diberikan dengan paket.

source: DEFAULTS
id: BAKU

source: B<%man%> will search for the desired manual pages within the I<index> database caches. If the B<-u> option is given, a cache consistency check is performed to ensure the databases accurately reflect the filesystem. If this option is always given, it is not generally necessary to run B<%mandb%> after the caches are initially created, unless a cache becomes corrupt. However, the cache consistency check can be slow on systems with many manual pages installed, so it is not performed by default, and system administrators may wish to run B<%mandb%> every week or so to keep the database caches fresh. To forestall problems caused by outdated caches, B<%man%> will fall back to file globbing if a cache lookup fails, just as it would if no cache was present.
id: B<%man%> akan mencari untuk halaman manual yang diinginkan didalam I<index> basis data cache. Jika opsi B<-u> diberikan, sebuah pemeriksaan cache konsistensi dilakukan untuk memastikan basis data secara akurat merefleksi sistem berkas. Jika opsi ini selalu diberikan, iti tidak secara umum diperlukan untuk menjalankan B<%mandb%> setelah cache dibuat pada awalnya, kecuali sebuah cache menjadi terkorupsi. Akan tetapi, pemeriksaan cache konsistensi dapat menjadi lambat di sistem dengan banyak halaman manual terpasang, jadi ini tidak dilakukan secara baku, dan sistem administrator mungkin akan menjalankan B<%mandb%> setiap minggu atau seperti itu untuk menjaga cache basis data segar. Untuk forestall masalah disebabkan oleh outdated caches, B<%man%> akan kembali ke berkas globbing jika sebuah pencarian cache gagal, hanya seperti itu jika tidak ada cache tetah ada.

source: Once a manual page has been located, a check is performed to find out if a relative preformatted `cat' file already exists and is newer than the nroff file. If it does and is, this preformatted file is (usually) decompressed and then displayed, via use of a pager. The pager can be specified in a number of ways, or else will fall back to a default is used (see option B<-P> for details). If no cat is found or is older than the nroff file, the nroff is filtered through various programs and is shown immediately.
id: Sekali sebuah halaman manual telah dilokasikan, sebuah pemeriksaan dilakukan untuk mencari tahu jika sebuah berkas `cat' relatif preformatted telah ada dan lebih baru dari berkas nroff. Jika ini dilakukan dan benar, berkas preformatted ini (biasanya) didekompress dan kemudian ditampilkan, dengan menggunakan sebuah pager. Pager dapat dispesifikasikan dalam beberapa cara, atau yang akan kembali ke baku jika digunakan (lihat opsi B<-P> untuk details). Jika tidak ada cat ditemukan atau lebih lama dari berkas nroff, nroff difilter melalui berbagai aplikasi dan ini diperlihatkan secara langsung.

source: If a cat file can be produced (a relative cat directory exists and has appropriate permissions), B<%man%> will compress and store the cat file in the background.
id: Jika sebuah berkas cat dapat dihasilkan (sebuag direktori cat relatif ada dan memiliki ijin yang sesuai), B<%man%> akan kompres dan simpan berkas cat dalam background.

source: The filters are deciphered by a number of means. Firstly, the command line option B<-p> or the environment variable $B<MANROFFSEQ> is interrogated. If B<-p> was not used and the environment variable was not set, the initial line of the nroff file is parsed for a preprocessor string. To contain a valid preprocessor string, the first line must resemble
id: Filter didechipered oleh sebuah angka dari rata rata. Pertama tama, opsi baris perintah B<-p> atau variabel lingkungan $B<MANROFFSEQ> diinterogasikan. jika B<-p> belum digunakan dan variabel lingkungan tidak diset, baris inisial dari berkas nroff diparse untuk sebuah string preprosesor. Untuk mengisi sebuah preprosesor string, baris pertama harus merepresentasikan

source: where B<string> can be any combination of letters described by option B<-p> below.
id: dimana B<string> dapat berupa kombinasi apapun dari kata dideskripsikan oleh opsi B<-p> dibawah.

source: If none of the above methods provide any filter information, a default set is used.
id: Jika tidak ada dari metode diatas menyediakan informasi penyaring apapun, sebuah set baku digunakan.

source: A formatting pipeline is formed from the filters and the primary formatter (B<nroff> or [B<tg>]B<roff> with B<-t>) and executed. Alternatively, if an executable program I<mandb_nfmt> (or I<mandb_tfmt> with B<-t>) exists in the man tree root, it is executed instead. It gets passed the manual source file, the preprocessor string, and optionally the device specified with B<-T> or B<-E> as arguments.
id: Sebuah formating pipeli dibentuk dari filter dan penformat utama (B<nroff> atau [B<tg>]B<roff> dengan B<-t>) dan dijalankan. Secara alternatif, jika sebuah aplikasi executable I<mandb_nfmt> (atau I<mandb_tfmt> dengan B<-t>) ada dalam akar pohon man, ini lebih baik dijalankan. Ini dilewatkan ke berkassumber manual, string preprosesor, dan secara opsional perangkat yang dispesifikasikan dengan B<-T> atau B<-E> sebagai arguments.

source: Non argument options that are duplicated either on the command line, in $B<MANOPT>, or both, are not harmful. For options that require an argument, each duplication will override the previous argument value.
id: Tidak ada opsi argumen yang merupakan duplikasi baik di baris perintah, dalam $B<MANOPT>, atau baik, yang berbahaya. Untuk opsi yang membutuhkan sebuah, argumen disetiap duplikasi akan override nilai argumen sebelumnya.

source: General options
id: Opsi umum

source: This option is normally issued as the very first option and resets B<%man%'s> behaviour to its default. Its use is to reset those options that may have been set in $B<MANOPT>. Any options that follow B<-D> will have their usual effect.
id: Opsi ini secara normal diisukan sebaga opsi paling pertama dan mereset B<%man%> perilaku ke bakunya. Ini digunakan untuk mereset opsi tersebut yang mungkin telah diset dalam $B<MANOPT>. Opsi apapun yang mengikuti B<-D> akan memiliki efek biasanya

source: B<--warnings>[=I<warnings>]
id: B<--warnigs>[=I<warnings>]

source: Enable warnings from I<groff>. This may be used to perform sanity checks on the source text of manual pages. I<warnings> is a comma-separated list of warning names; if it is not supplied, the default is "mac".
id: Aktifkan peringatan dari I<groff>. Ini mungkin digunakan untuk menjalankan pemeriksaan kesadaran dalam sumber teks dari halaman manual. I<peringatan> adalah daftar dipisahkan dengan koma dari nama peringatan; jika tidak disupli, baku adalah "mac".

source: Main modes of operation
id: Mode operasi utama

source: Equivalent to B<%whatis%>. Display a short description from the manual page, if available. See B<%whatis%>(1) for details.
id: Sama dengan B<%whatis%>. Tampilkan sebuah deskripsi singkat dari halaman manual, jika tersedia. Lihat B<%whatis%>(1) untuk details.

source: Equivalent to B<%apropos%>. Search the short manual page descriptions for keywords and display any matches. See B<%apropos%>(1) for details.
id: Sama dengan B<%apropos%>. Cari deskrips halaman manual pendek untuk kata kunci dan tampilkan kecocokan apapun. Lihat B<%apropos%>(1) untuk lengkapnya.

source: Activate `local' mode. Format and display local manual files instead of searching through the system's manual collection. Each manual page argument will be interpreted as an nroff source file in the correct format. No cat file is produced. If '-' is listed as one of the arguments, input will be taken from stdin. When this option is not used, and man fails to find the page required, before displaying the error message, it attempts to act as if this option was supplied, using the name as a filename and looking for an exact match.
id: Aktivasikan mode `lokal'. Format dan tampilkan berkas manual lokal daripada mencari melalui koleksi sistem manual. Setiap argumen halaman manual akan diinterpretasikan sebuah sebuah berkas sumber nroff dalam format yang benar. Tidak ada berkas cat dihasilkan. Jika `-' ini didaftar sebagai salah satu dari argumen, masukan akan diambil dari stdin. Ketika opsi ini tidak digunakan, dan man gagal untuk menemukan halaman yang dibutuhkan, sebelum menampilkan pesan error, ini mencoba untuk berlaku seperti jika opsi ini telah diberikan menggunakan nama sebagai sebuah nama berkas dan mencari untuk sebuah pencocokan tepat.

source: Don't actually display the manual pages, but do print the location(s) of the source nroff files that would be formatted.
id: Jangan secara aktual menampilkan halaman manual, tetapi lakukan pencetakan lokasi dari berkas sumber nroff yang akan diformat.

source: Don't actually display the manual pages, but do print the location(s) of the cat files that would be displayed. If -w and -W are both specified, print both separated by a space.
id: Jangan secara aktual menampilkan halaman manual, tetapi lakukan pencetakan lokasi dari berkas cat yang akan ditampilkan. Jika -w dan -W keduanya dispesifikasikan, cetak keduanya dipisahkan oleh sebuah spasi.

source: This option is not for general use and should only be used by the B<%catman%> program.
id: Opsi in tidak untuk penggunaan umum dan seharusnya hanya digunakan oleh aplikasi B<%catman%>.

source: B<-R\ >I<encoding>,\ B<--recode>=I<encoding>
id: B<-R\ >I<pengkodean>,\ B<--recode>=I<pengkodean>
