Repository: Distrotech/man-db
Catalog: man/po4a/po/*.po
Languages: id

source: B<%mandb%>(8), B<%manpath%>(1), B<manpath>(5), B<%apropos%>(1), B<%whatis%>(1), B<%catman%>(8), B<less>(1), B<nroff>(1), B<troff>(1), B<groff>(1), B<%zsoelim%>(1), B<setlocale>(3), B<man>(7), B<ascii>(7), B<latin1>(7), the man-db package manual, B<FSSTND>.
id: B<%mandb%>(8), B<%manpath%>(1), B<manpath>(5), B<%apropos%>(1), B<%whatis%>(1), B<%catman%>(8), B<less>(1), B<nroff>(1), B<troff>(1), B<groff>(1), B<%zsoelim%>(1), B<setlocale>(3), B<man>(7), B<ascii>(7), B<latin1>(7), paket manual man-db, B<FSSTND>.

source: HISTORY
id: SEJARAH

source: 1990, 1991 - Originally written by John W. Eaton (jwe@che.utexas.edu).
id: 1990, 1991 - Awalnya ditulis oleh John W. Eaton (jwe@che.utexas.edu).

source: Dec 23 1992: Rik Faith (faith@cs.unc.edu) applied bug fixes supplied by Willem Kasdorp (wkasdo@nikhefk.nikef.nl).
id: Dec 23 1992: Rik Faith (faith@cs.unc.edu) perbaikan bug diberikan oleh Willem Kasdorp (wkasdo@nikhefk.nikef.nl).

source: 30th April 1994 - 23rd February 2000: Wilf. (G.Wilford@ee.surrey.ac.uk) has been developing and maintaining this package with the help of a few dedicated people.
id: 30th April 1994 - 23rd February 2000: Wilf. (G.Wilford@ee.surrey.ac.uk) telah mengembangkan dan memelihara paket ini dengan bantuan dari beberapa orang berdedikasi.

source: 30th October 1996 - 30th March 2001: Fabrizio Polacco E<lt>fpolacco@debian.orgE<gt> maintained and enhanced this package for the Debian project, with the help of all the community.
id: 30th Oktober 1996 - 30 Maret 2001: Fabrizio Polacco E<lt>fpolacco@debian.orgE<gt> memelihara dan meningkatkan paket ini untuk project Debian, dengan bantuan dari seluruh komunitas.

source: 31st March 2001 - present day: Colin Watson E<lt>cjwatson@debian.orgE<gt> is now developing and maintaining man-db.
id: 31 Maret 2001 - sekarang: Colin Watson E<lt>cjwatson@debian.orgE<gt> saat ini mengembangkan dan memeliharan man-db.

source: %manconv% - convert manual page from one encoding to another
id: %manconv% - mengubah halaman manual dari satu pengkodean ke yang lain

source: B<%manconv%> B<-f> I<from-code>\|[:I<from-code>\|.\|.\|.] B<-t> I<to-code> [\|B<-dqhV>\|] [\|I<filename>\|]
id: B<%manconv%> B<-f> I<dari-kode>\|[:I<dari-kode>\|.\|.\|.] B<-t> I<ke-kode> [\|B<-dqhV>\|] [\|I<nama berkas>\|]

source: B<%manconv%> converts a manual page from one encoding to another, like B<iconv>. Unlike B<iconv>, it can try multiple possible input encodings in sequence. This is useful for manual pages installed in directories without an explicit encoding declaration, since they may be in UTF-8 or in a legacy character set.
id: B<%manconv%> mengubah sebuah halaman manual dari satu pengkodean ke yang lain, seperti B<iconv>. Tidak seperti B<iconv>, ini dapat mencoba beberapa kemungkinan pengkodean masukan dalam urutan. Ini berguna untuk halaman manual terpasang dalam direktori tanpa sebuah deklarasi pengkodean eksplisit, karena mereka mungkin berada dalam UTF-8 atau dalam sebuah set karakter legacy.

source: If an encoding declaration is found on the first line of the manual page, that declaration overrides any input encodings specified on B<%manconv%>'s command line. Encoding declarations have the following form:
id: Jika sebuah deklarasi pengkodean ditemukan dalam baris pertama dari halaman manual deklarasi itu overrides pengkodean masukan apapun dispesifikasikan di baris perintah B<%manconv%>. Deklarasi pengkodean memiliki bentuk berikut:

source: or (if manual page preprocessors are also to be declared):
id: atau (jika preprosesor halaman manual juga dideklarasikan):

source: B<-f> I<encodings>, B<--from-code> I<encodings>
id: B<-f> I<pengkodean>, B<--from-code> I<pengkodean>

source: Try each of I<encodings> (a colon-separated list) in sequence as the input encoding.
id: Coba setiap dari I<pengkodean> (sebuah daftar dipisahkan kolon) dalam urutan pengkodean masukan.

source: B<-t> I<encoding>, B<--to-code> I<encoding>
id: B<-t> I<pengkodean>, B<--to-code> I<pengkodean>

source: Convert the manual page to I<encoding>.
id: Ubah halaman manual ke I<pengkodean>.

source: Do not issue error messages when the page cannot be converted.
id: Jangan isukan pesan error ketika halaman tidak dapat diubah.

source: %manpath% - determine search path for manual pages
id: %manpath% - menentukan jalur pencarian untuk halaman manual

source: B<%manpath%> [\|B<-qgdchV>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-C> I<file>\|]
id: B<%manpath%> [\|B<-qgdchV>\|] [\|B<-m> I<sistem>\|[\|,.\|.\|.\|]\|] [\|B<-C> I<berkas>\|]

source: If $B<MANPATH> is set, B<%manpath%> will simply display its contents and issue a warning. If not, B<%manpath%> will determine a suitable manual page hierarchy search path and display the results.
id: Jika $B<MANPATH> diset, B<%manpath%> akan secara sederhana menampilkan isinya dan mengisukan peringatan. Jika tidak, B<%manpath%> akan menentukan sebuah hierarki jalur pencarian halaman manual yang sesuai dan menampilkan hasilnya.

source: The colon-delimited path is determined using information gained from the man-db configuration file - (I<%manpath_config_file%>) and the user's environment.
id: Jalur dipisahkan kolon ditentukan menggunakan informasi diperoleh dari berkas konfigurasi man-db - (I<%manpath_config_file%>) dan lingkungan pengguna.

source: Do not issue warnings.
id: Jangan isukan peringatan.

source: Produce a catpath as opposed to a manpath. Once the manpath is determined, each path element is converted to its relative catpath.
id: Hasilkan sebuah jalur cat daripada ke sebuah jalur man. Sekali jalur man ditentukan, setiap elemen jalur diubah ke relatif jalur cat.

source: Produce a manpath consisting of all paths named as `global' within the man-db configuration file.
id: Hasilkan sebuah jalur path terdiri dari seluruh jalur bernama sebagai `global' didalam berkas konfigurasi man-db.

source: If this system has access to other operating system's manual hierarchies, this option can be used to include them in the output of B<%manpath%>. To include NewOS's manual page hierarchies use the option B<-m> B<NewOS>.
id: Jika sistem ini memiliki akses ke hierarki sistem manual sistem operasi lain, opsi ini dapat digunakan untuk memasukannya dalam keluaran dari B<%manpath%>. Untuk memasukan hierarki halaman manual OS baru gunakan opsi B<-m> B<OS baru>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include the native operating system's manual page hierarchies, the system name B<man> must be included in the argument string. This option will override the $B<SYSTEM> environment variable.
id: I<sistem> spesifikasi dapat berupa sebuah kombinasi dari nama sistem operasi dipisahkan koma. Untuk memasukan hierarki halaman manual sistem operasi native, nama sistem B<man> harus dimasukan dalam argumen string. Opsi ini akan override variabel lingkungan $B<SYSTEM>.

source: If $B<MANPATH> is set, B<%manpath%> displays its value rather than determining it on the fly. If $B<MANPATH> is prefixed by a colon, then the value of the variable is appended to the list determined from the content of the configuration files. If the colon comes at the end of the value in the variable, then the determined list is appended to the content of the variable. If the value of the variable contains a double colon (B<::>), then the determined list is inserted in the middle of the value, between the two colons.
id: Jika $B<MANPATH> diset, B<%manpath%> menampilkan nilainya daripada menentukannya diwaktu jalan. Jika $B<MANPATH> diawali oleh sebuah kolon, maka nilai dari variabel ditambahkan ke daftar ditentukan dari isi dari berkas konfigurasi. Jika kolon datang di akhir dari nilai dalam variabel, maka daftar ditentukan ditambahkan ke isi dari variabel. Jika nilai dari variabel berisi kolon ganda (B<::>), maka daftar yang ditentukan dimasukan ditengah dari nilai, diantara dua kolon.

source: %whatis% - display manual page descriptions
id: %whatis% - menampilkan deskripsi halaman manual

source: B<%whatis%> [\|B<-dlhvV>\|] [\|B<-r>\||\|B<-w>\|] [\|B<-s> I<section>\|] [\|B<-m> I<system>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<path>\|] [\|B<-L> I<locale>\|] [\|B<-C> I<file>\|] I<name> \&.\|.\|.
id: B<%whatis%> [\|B<-dlhvV>\|] [\|B<-r>\||\|B<-w>\|] [\|B<-s> I<bagian>\|] [\|B<-m> I<sistem>\|[\|,.\|.\|.\|]\|] [\|B<-M> I<jalur>\|] [\|B<-L> I<lokal>\|] [\|B<-C> I<berkas>\|] I<nama> \&.\|.\|.

source: Each manual page has a short description available within it. B<%whatis%> searches the manual page names and displays the manual page descriptions of any I<name> matched.
id: Setiap halaman manual memiliki sebuah deskripsi singkat tersedia didalamnya. B<%whatis%> mencari nama halaman manual dan menampilkan deskripsi halaman manual dari I<nama> apapun yang cocok.

source: I<name> may contain wildcards (B<-w>) or be a regular expression (B<-r>). Using these options, it may be necessary to quote the I<name> or escape (\e) the special characters to stop the shell from interpreting them.
id: I<name> mungkin berisi wildcards (B<-w>) atau berupa sebuah ekpresi regular (B<-r>). Menggunakan opsi ini, mungkin diperlukan untuk quote I<name> atau escape (\e) karakter spesial untuk menghentikan shell dari mengintepretasikannya.

source: B<index> databases are used during the search, and are updated by the B<%mandb%> program. Depending on your installation, this may be run by a periodic cron job, or may need to be run manually after new manual pages have been installed. To produce an old style text B<whatis> database from the relative B<index> database, issue the command:
id: B<indeks> basis data digunakan selama pencarian, dan perbarui oleh aplikasi B<%mandb%>. Tergantung dari pemasangan anda, ini mungkin dijalankan oleh sebuah pekerjaan periodik cron, atau mungkin butuh dijalankan secara manual setelah halaman manual baru telah terpasang. Untuk menghasilkan teks gaya lama B<whatis> basis data dari relatif B<index> basis data, berikan perintah:

source: B<%whatis% -M> I<manpath> B<-w '*' | sort E<gt>> I<manpath/whatis>
id: B<%whatis% -M> I<jalur man> B<-w '*' | sort E<gt>> I<jalur man/whatis>

source: where I<manpath> is a manual page hierarchy such as I</usr/man>.
id: dimana I<jalur man> adalah sebuah hierarki halaman manual seperti I</usr/man>.

source: Interpret each I<name> as a regular expression. If a I<name> matches any part of a page name, a match will be made. This option causes B<%whatis%> to be somewhat slower due to the nature of database searches.
id: Intepretasikan setiap I<nama> sebagai sebuah ekspresi regular. Jika sebuah I<name> cocok dengan bagian apapu dari halaman manual, sebuah pencocokan akan dibuat. Opsi ini menyebabkan B<%whatis%> mungkin lebih lambat karena cara kerja pencarian basis data.

source: Interpret each I<name> as a pattern containing shell style wildcards. For a match to be made, an expanded I<name> must match the entire page name. This option causes B<%whatis%> to be somewhat slower due to the nature of database searches.
id: Interpretasikan setiap I<nama> sebagai sebuah pola berisi shell style wildcards. Untuk sebuah pencocokan untuk dibuat, sebuah I<nama> terekspan harus cocok dengan seluruh nama halaman. Opsi ini menyebabkan B<%whatis%> menjadi lebih lambat karena cara kerja dari pencarian basis data.

source: If this system has access to other operating system's manual page names, they can be accessed using this option. To search NewOS's manual page names, use the option B<-m> B<NewOS>.
id: Jika sistem ini memiliki akses ke nama halaman manual sistem operasi lain, mereka dapat diakses dengan menggunakan opsi ini. Untuk mencari nama halaman manual OS baru, gunakan opsi B<-m> B<OS baru>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include a search of the native operating system's manual page names, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
id: I<sistem> spesifikasi dapat berupa sebuah kombinasi dari nama sistem operasi dipisahkan dengan koma. Untuk memasukan sebuah pencarian dari nama halaman manual sistem operasi native, masukan nama sistem B<man> dalam argumen string. Opsi ini akan override variabel lingkungan $B<SYSTEM>.

source: %zsoelim% - satisfy .so requests in roff input
id: %zsoelim% - memuaskan permintaan .so dalam masukan roff

source: B<%zsoelim%> [\|B<-CVh>\|] [\|I<file> \&.\|.\|.\|]
id: B<%zsoelim%> [\|B<-CVh>\|] [\|I<berkas> \&.\|.\|.\|]

source: B<%zsoelim%> parses I<file> arguments, or if none are specified, its standard input for lines of the form:
id: B<%zsoelim%> parses argumen I<berkas>, atau jika none dispesifikasikan, standar masukannya untuk baris dari bentuk:

source: B<.so> E<lt>\|I<filename>\|E<gt>
id: B<.so> E<lt>\|I<nama berkas>\|E<gt>

source: These requests are replaced by the contents of the I<filename> specified. If the request cannot be met, B<%zsoelim%> looks for I<filename.ext> where I<.ext> can be one of B<.gz>, B<.Z> or B<.z>. Other extension types may be supported depending upon compile time options. If the request can be met by a compressed file, this file is decompressed using an appropriate decompressor and its output is used to satisfy the request.
id: Permintaan ini digantikan oleh isi dari I<nama berkas> dispesifikan. Jika permintaan tidak dapat dipenuhi, B<%zsoelim%> mencari untuk I<nama berkas.ext> dimana I<.ext> dapat salah satu dari B<.gz>, B<.Z> atau B<.z>. Tipe ekstensi lain mungkin didukung tergantung dari opsi waktu kompilasi. Jika permintaan dapat dipenuhi oleh berkas terkompress, berkas ini didekompress menggunakan sebuah dekompressor yang sesuai dan keluarannya digunakan untuk memuaskan permintaan.

source: Traditionally, B<soelim> programs were used to allow roff preprocessors to be able to preprocess the files referred to by the requests. This particular version was written to circumvent problems created by support for compressed manual pages.
id: Secara tradisional, aplikasi B<soelim> digunakan untuk mengijinkan preprosesor roff untuk dapat mempreproses berkas direferensi oleh permintaan. Versi ini telah ditulis untuk mengatasi masalah yang dibuat untuk mendukung halaman manual terkompres.

source: This flag is available for compatibility with other B<soelim> programs. Its use is to enable .so requests followed by something other than whitespace. As this is already the default behaviour, it is ignored.
id: Opsi ini tersedia untuk kompabilitas dengan aplikasi B<soelim> lain. Ini digunakan untuk mengaktifkan permintaan .so diikuti oleh sesuatu selain spasi. Seperti ini telah menjadi perilaku baku, ini diabaikan.

source: manpath - format of the %manpath_config_file% file
id: manpath - format dari berkas %manpath_config_file%

source: The manpath configuration file is used by the manual page utilities to assess users' manpaths at run time, to indicate which manual page hierarchies (manpaths) are to be treated as system hierarchies and to assign them directories to be used for storing cat files.
id: Berkas konfigurasi manpath digunakan oleh perangkat halaman manual untuk mengakses manpath pengguna di waktu jalan, mengindikasikan hierarki halaman manual mana (manpath) yang diperlukan sebagai sistem hierarki dan menempatkan direktori untuk digunakan untuk penyimpanan berkas cat.

source: If the environment variable $B<MANPATH> is already set, the information contained within %manpath_config_file% will not override it.
id: Jika variabel lingkungan $B<MANPATH> telah diset, informasi berisi dalam %manpath_config_file% akan mengoverridenya.

source: The following field types are currently recognised:
id: Tipe daerah berikut saat ini dikenal:

source: B<#>I<\ comment>
id: B<#>I<\ komentar>

source: Blank lines or those beginning with a B<#> will be treated as comments and ignored.
id: Baris kosong atau yang berawal dengan sebuah B<#> akan diperlakukan sebagai komentar dan akan diabaikan.

source: Lines of this form indicate manpaths that every automatically generated $B<MANPATH> should contain. This will typically include I</usr/man>.
id: Baris dari bentuk ini mengindikasikan jalur man yang secara otomatis menghasilkan $B<MANPATH> seharusnya berisi. Ini akan biasanya termasuk I</usr/man>.

source: Lines of this form set up $B<PATH> to $B<MANPATH> mappings. For each I<path_element> found in the user's $B<PATH>, I<manpath_element> will be added to the $B<MANPATH>.
id: Baris dari form set up ini $B<PATH> ke $B<MANPATH> pemetaan. Untuk setiap I<path_element> ditemukan dalam $B<PATH> pengguna, I<manpath_element> akan ditambahkan ke $B<MANPATH>.

source: Lines of this form indicate which manpaths are to be treated as system manpaths, and optionally where their cat files should be stored. This field type is particularly important if B<man> is a setuid program, as (when in the system configuration file %manpath_config_file% rather than the per-user configuration file .manpath) it indicates which manual page hierarchies to access as the setuid user and which as the invoking user.
id: Baris dari bentuk ini mengindikasikan jalur man man yang diperlakukan sebagai sistem manpath, dan secara opsional dimana berkas catnya seharusnya disimpan. Tipe bagian ini biasanya penting jika B<man> adalah aplikasi setuid, seperti (ketika dalam berkas sistem konfigurasi %manpath_config_file% daripada berkas konfiguras setiap pengguna .manpath) ini mengindikasikan hierarki halaman manual mana untuk diakses sebagai setuid pengguna dan mana yang memanggil pengguna.

source: The system manual page hierarchies are usually those stored under I</usr> such as I</usr/man>, I</usr/local/man> and I</usr/X11R6/man>.
id: Hierarki sistem halaman manual biasanya disimpan dibawah I</usr> seperti I</usr/man>, I</usr/local/man> dan I</usr/X11R6/man>.

source: If cat pages from a particular I<manpath_element> are not to be stored or are to be stored in the traditional location, I<catpath_element> may be omitted.
id: Jika halaman cat dari I<manpath_element> tertentu tidak disimpan atau akan disimpan dalam lokasi tradisional, I<catpath_element> mungkin diabaikan.

source: Traditional cat placement would be impossible for read only mounted manual page hierarchies and because of this it is possible to specify any valid directory hierarchy for their storage. To observe the B<Linux FSSTND> the keyword `B<FSSTND> can be used in place of an actual directory.
id: Penempatan cat tradisional tidak memungkinkan untuk hierarki halaman manual dipasang baca saja dan karean ini mungkin untuk menspesifikasi hierarki direktori valid apapun untuk penyimpanan. Untuk mengobservasi B<Linux FSSTND> kata kunci `B<FSSTND> dapat digunakan daripada direktori aktual.

source: Unfortunately, it is necessary to specify B<all> system man tree paths, including alternate operating system paths such as I</usr/man/sun> and any B<NLS locale> paths such as I</usr/man/de_DE.88591>.
id: Sayangnya, ini diperlukan untuk menspesifikasikan B<all> pohon jalur sistem manual, termasuk jalur sistem operasi alternatif seperti I</usr/man/sun> dan B<NLS locale> jalur apapun seperti I</usr/man/de_DE.88591>.

source: As the information is parsed line by line in the order written, it is necessary for any manpath that is a sub-hierarchy of another hierarchy to be listed first, otherwise an incorrect match will be made. An example is that I</usr/man/de_DE.88591> must come before I</usr/man>.
id: Karena informasi diambil baris demi bari dalam urutan penulisan, ini diperlukan untuk jalur man apapun yang berupa sub-hierarki dari hierarki lain untuk ditampilkan pertama, jika tidak sebuah pencocokan tidak benar terjadi. Sebuah contoh adalah I</usr/man/de_DE.88591> harus datang sebelum I</usr/man>.

source: B<DEFINE>I<\ key\ value>
id: B<DEFINE>I<\ kunci\ nilai>

source: Lines of this form define miscellaneous configuration variables; see the default configuration file for those variables used by the manual pager utilities. They include default paths to various programs (such as I<grep> and I<tbl>), and default sets of arguments to those programs.
id: Baris dari bentuk ini mendefinisikan variabel konfigurasi miscellaneous; lihat berkas konfigurasi baku untuk variabel tersebut digunakan oleh manual pager perangkat. Jalur baku termasuk berbagai aplikasi (seperti I<grep> dan I<tbl>), dab baku set dari argumen ke aplikasi tersebut.

source: This flag prevents B<%man%>(1) from creating cat pages automatically.
id: Opsi ini menjaga B<%man%>(1) dari membuat halaman cat secara otomatis.

source: Unless the rules above are followed and observed precisely, the manual pager utilities will not function as desired. The rules are overly complicated.
id: Kecuali aturan diatas diikuti dan diobservasi secara tepat, perangkat manual peger tidak akan berfungsi seperti yang diinginkan. Aturan overlay kompleks.

source: accessdb - dumps the content of a man-db database in a human readable format.
id: accessdb - dump isi dari sebuah basis data man-db dalam format yang mudah dibaca.

source: B</usr/sbin/accessdb> [\|B<-hV>\|] [I<E<lt>index-fileE<gt>>]
id: B</usr/sbin/accessdb> [\|B<-hV>\|] [I<E<lt>indeks-fileE<gt>>]

source: B<accessdb> will output the data contained within a man-db database in a human readable form. By default, it will dump the data from B</var/cache/man/index.E<lt>db-typeE<gt>,> where E<lt>db-typeE<gt> is dependent on the database library in use.
id: B<accessdb> akan mengeluarkan data berisi dalam sebuah basis data man-db dalam sebuah bentuk yang mudah dibaca. Secara baku, ini akan dump data dari B</var/cache/man/index.E<lt>db-typeE<gt>,> dimana E<lt>db-typeE<gt> tergantung dari perpustakaan basis data yang digunakan.

source: Supplying an argument to accessdb will override this default.
id: Memberikan sebuah argumen ke accessdb akan mengoverride baku ini.

source: $mtime$ -E<gt> "795987034" $version$ -E<gt> "2.3.1" apropos -E<gt> "1 1 795981542 A - - search the manual page names and descriptions" catman -E<gt> "8 8 795981544 A - - create or update the pre-formatted manual pages" man -E<gt> "1 1 795981542 A - - an interface to the on-line reference manuals" mandb -E<gt> "8 8 795981544 A - - create or update the manual page index caches" manpath -E<gt> " 1 5" manpath~1 -E<gt> "1 1 795981542 A - - determine search path for manual pages" manpath~5 -E<gt> "5 5 795981543 A - - format of the /etc/man_db.config file" whatis -E<gt> "1 1 795981543 A - - search the manual page names" zsoelim -E<gt> "1 1 795981543 A - - satisfy .so requests in roff input"
id: $mtime$ -E<gt> "795987034" $version$ -E<gt> "2.3.1" apropos -E<gt> "1 1 795981542 A - - cari nama halaman manual dan deskripsinya" catman -E<gt> "8 8 795981544 A - - buat atau format halaman manual sebelum terformat" man -E<gt> "1 1 795981542 A - - sebuah antarmuka ke referensi online manuals" mandb -E<gt> "8 8 795981544 A - - buat atau update halaman manual index caches" manpath -E<gt> " 1 5" manpath~1 -E<gt> "1 1 795981542 A - - tentukan jalur pencarian untuk halaman manual" manpath~5 -E<gt> "5 5 795981543 A - - format dari /etc/man_db.config berkas" whatis -E<gt> "1 1 795981543 A - - cari nama halaman manual" zsoelim -E<gt> "1 1 795981543 A - - puaskan permintaan .so dalam masukan roff"

source: %catman% - create or update the pre-formatted manual pages
id: %catman% - buat atau update pre-formatted halaman manual

source: B<%catman%> [\|B<-dhV>\|] [\|B<-M> I<path>\|] [\|B<-C> I<file>\|] [\|I<section>\|] \&.\|.\|.
id: B<%catman%> [\|B<-dhV>\|] [\|B<-M> I<jalur>\|] [\|B<-C> I<berkas>\|] [\|I<bagian>\|] \&.\|.\|.
