Repository: Distrotech/man-db
Catalog: man/po4a/po/*.po
Languages: id

source: Instead of formatting the manual page in the usual way, output its source converted to the specified I<encoding>. If you already know the encoding of the source file, you can also use B<%manconv%>(1) directly. However, this option allows you to convert several manual pages to a single encoding without having to explicitly state the encoding of each, provided that they were already installed in a structure similar to a manual page hierarchy.
id: Daripada memformat halaman manual dalam cara biasa, keluarkan sumbernya yang akand diubah ke I<pengkodean> yang telah dispesifikasikan. Jika anda telah tahu pengkodean dari berkas sumber, anda juga dapat menggunakan B<%manconv%>(1) secara langsung. Akan tetapi, opsi ini mengijinkan anda untuk mengubah beberapa halaman manual ke sebuah pengkodean tunggal tanpa harus menyatakan secara eksplisit keadaan dari setiap pengkodean, dengan kondisi bahwa mereka telah terpasang dalam sebuah struktur yang sama ke sebuah struktur halaman manual.

source: Finding manual pages
id: Mencari halaman manual

source: If this system has access to other operating system's manual pages, they can be accessed using this option. To search for a manual page from NewOS's manual page collection, use the option B<-m> B<NewOS>.
id: Jika sistem ini memiliki akses ke halaman manual sistem operasi lain, mereka dapat diakses menggunakan opsi ini. Untuk mencari sebuah halaman manual dari koleksi halaman manual OS-Baru, gunakan opsi B<-m> B<OS-Baru>.

source: The I<system> specified can be a combination of comma delimited operating system names. To include a search of the native operating system's manual pages, include the system name B<man> in the argument string. This option will override the $B<SYSTEM> environment variable.
id: I<sistem> yang dispesifikasikan dapat berupa sebuah kombinasi dari nama sistem operasi dipisahkan oleh koma. Untuk memasukan sebuah pencarian dari halaman manual sistem operasi lkal, masukan nama sistem B<man> dalam string argumen. Opsi ini akan override variabel lingkungan $B<SYSTEM>.

source: Specify an alternate manpath to use. By default, B<%man%> uses B<%manpath%> derived code to determine the path to search. This option overrides the $B<MANPATH> environment variable and causes option B<-m> to be ignored.
id: Spesifikasikan sebuah jalur man alternatif untuk digunakan. Secara baku, B<%man%> menggunakan B<%manpath%> kode turunan untuk menentukan jalur pencarian. Opsi ini overrides variabel lingkungan $B<MANPATH> dan dapat menyebabkan opsi B<-m> untuk diabaikan.

source: A path specified as a manpath must be the root of a manual page hierarchy structured into sections as described in the man-db manual (under "The manual page system"). To view manual pages outside such hierarchies, see the B<-l> option.
id: Sebuah jalur dispesifikasikan sebagai sebuah jalur manual harus berupa akar dari struktur halaman manual terstruktur dalam daerah seperti dijelaskan dalam manual man-db (dibawah "Halaman manual sistem"). Untuk melihat halaman manual diluar dari struktur seperti itu, lihat opsi B<-l>.

source: B<-S\ >I<list>B<,\ -s\ >I<list>B<,\ --sections=>I<list>
id: B<-S\ >I<daftar>B<,\ -s\ >I<daftar>B<,\ --sections=>I<daftar>

source: List is a colon- or comma-separated list of `order specific' manual sections to search. This option overrides the $B<MANSECT> environment variable. (The B<-s> spelling is for compatibility with System V.)
id: Daftar adalah sebuah kolon- atau daftar dipisahkan oleh koma dari daerah manual `order specific' untuk mencari. Opsi ini override variabel lingkungan $B<MANSECT> (Penyebutan B<-s> adalah untuk kompabilitas dengan Sistem V.)

source: B<-e\ >I<sub-extension>B<,\ --extension=>I<sub-extension>
id: B<-e\ >I<sub-ekstensi>B<,\ --extension=>I<sub-extension>

source: Some systems incorporate large packages of manual pages, such as those that accompany the B<Tcl> package, into the main manual page hierarchy. To get around the problem of having two manual pages with the same name such as B<exit>(3), the B<Tcl> pages were usually all assigned to section B<l>. As this is unfortunate, it is now possible to put the pages in the correct section, and to assign a specific `extension' to them, in this case, B<exit>(3tcl). Under normal operation, B<%man%> will display B<exit>(3) in preference to B<exit>(3tcl). To negotiate this situation and to avoid having to know which section the page you require resides in, it is now possible to give B<%man%> a I<sub-extension> string indicating which package the page must belong to. Using the above example, supplying the option B<-e\ tcl> to B<%man%> will restrict the search to pages having an extension of B<*tcl>.
id: Beberapa sistem menggunakan paket besar dari halaman manual, seperti yang menyertai paket B<Tcl>, kedalam hierarki halaman manual utama. Untuk menyelesaikan masalah dari memiliki dua halaman manual dengan nama sama seperti B<exit>(3), halaman B<Tcl> biasanya semuanya dilengkapi dengan bagian B<l>. Seperti ini disayangkan, ini sekarang memungkinkan untuk menempatkan halaman dalam bagian yang benar, dan menempatkan spesifik `ekstensi' ke halaman tersebut, dalam kasus ini, B<exit>(3tcl). Dalam operasi normal, B<%man%> akan menampilkan B<exit>(3) dalam kesukaan ke B<exit>(3tcl). Untuk menegosiasikan situasi ini dan menghindari harus mengetahui halaman bagian mana yang membutuhkan tempat dimana, sekarang memungkinkan untuk memberikan B<%man%> sebuah I<sub-extension> string menandakan paket mana halaman tersebut harus berada. Menggunakan contoh diatas, diberikan opsi B<-e\ tcl> ke B<%man%> akan membatasi pencarian halaman memiliki sebuah ekstensi dari B<*tcl>.

source: Ignore case when searching for manual pages. This is the default.
id: Abaikan besar huruf ketika mencari untuk halaman manual. Ini adalah baku.

source: Search for manual pages case-sensitively.
id: Cari untuk halaman manual dengan mempertimbangkan besar huruf.

source: By default, B<%man%> will exit after displaying the most suitable manual page it finds. Using this option forces B<%man%> to display all the manual pages with names that match the search criteria.
id: Secara baku, B<%man%> akan keluar setelah menampilkan halaman manual paling sesuai dari yang ditemukan. Menggunakan opsi ini memaksa B<%man%> untuk menampilkan seluruh halaman manual dengan nama yang cocok dengan kriteria pencarian.

source: This option causes B<%man%> to perform an `inode level' consistency check on its database caches to ensure that they are an accurate representation of the filesystem. It will only have a useful effect if B<%man%> is installed with the setuid bit set.
id: Opsi ini menyebabkan B<%man%> untuk melakukan sebuah pemeriksaan konsistensi `tingkat inode' di cache basis datanya untuk memastikan bahwa mereka adalah representasi akurat dari sistem berkas. Ini hanya akan memiliki efek berguna jika B<%man%> dipasang dengan setuid bit diset.

source: Controlling formatted output
id: Mengotronl keluaran terformat

source: Specify which output pager to use. By default, B<%man%> uses B<%pager%>. This option overrides the $B<MANPAGER> environment variable, which in turn overrides the $B<PAGER> environment variable. It is not used in conjunction with B<-f> or B<-k>.
id: Spesifikasikan pager keluaran mana yang akan digunakan, Secara baku, B<%man%> menggunakan B<%pager%>. Opsi ini override variabel lingkungan $B<MANPAGER>, yang jadinya mengoverrides variabel lingkungan $B<PAGER>. Ini tidak digunakan dengan konjungsi dengan B<-f> atau B<-k>.

source: If a recent version of B<less> is used as the pager, B<%man%> will attempt to set its prompt and some sensible options. The default prompt looks like
id: Jika sebuah versi baru dari B<less> digunakan sebagai sebuah pager, B<%man%> akan mencoba untuk menset promptnya dan beberapa opsi. Prompt baku akan tampak

source: B<\ Manual page>I<\ name>B<(>I<sec>B<)>B<\ line>I<\ x>
id: B<\ Halaman manual>I<\ nama>B<(>I<sec>B<)>B<\ baris>I<\ x>

source: where I<name> denotes the manual page name, I<sec> denotes the section it was found under and I<x> the current line number. This is achieved by using the $B<LESS> environment variable.
id: dimana I<nama> menyatakan nama halaman manual, I<sec> menyatakan bagian itu yang ditemukan dibawah dan I<x> nomor baris sekarang. Ini dicapai dengan menggunakan variabel lingkungan $B<LESS>.

source: Supplying B<-r> with a string will override this default. The string may contain the text B<$MAN_PN> which will be expanded to the name of the current manual page and its section name surrounded by `(' and `)'. The string used to produce the default could be expressed as
id: Memberikan B<-r> dengan sebuah string akan override baku ini. String mungkin berisi teks B<$MAN_PN> yang akan diekspan ke nama dari halama manual sekarang dan nama bagiannya yang dilingkupi oleh `(' dan `)'. String digunakan untuk menghasilkan baku dapat diekspresikan sebagai

source: B<byte\e\ %bB?s/%s..?\e\ (END):?pB\ %pB\e\e%..>
id: B<byte\e\ %bB?e/%s..?\e\ (AKHIR):?pB\ %pB\e\e%..>

source: It is broken into two lines here for the sake of readability only. For its meaning see the B<less>(1) manual page. The prompt string is first evaluated by the shell. All double quotes, back-quotes and backslashes in the prompt must be escaped by a preceding backslash. The prompt string may end in an escaped $ which may be followed by further options for less. By default B<%man%> sets the B<-ix8> options.
id: Ini terpecah kedalam dua baris disini untuk memudahkan pembacaan saja. Untuk artinya lihat halaman manual B<less>(1). Prompt string pertama dievaluasi oleh shell. Semua double quotes, back-quotes dan backslashes dalam prompt harus diescaped dengan sebuah awalan backslash. Prompt string mungkin berakhir dalam sebuah escape $ yang mungkin diikuti oleh opsi selanjutnya untuk less. Secara baku B<%man%> menset opsi B<-ix8>.

source: If you want to override B<%man%>'s prompt string processing completely, use the $B<MANLESS> environment variable described below.
id: Jika anda ingin mengoverride pemrosesan prompt string B<%man%> secara lengkap , gunakan variabel lingkunan $B<MANLESS> dijelaskan dibawah.

source: When viewing a pure I<ascii>(7) manual page on a 7 bit terminal or terminal emulator, some characters may not display correctly when using the I<latin1>(7) device description with B<GNU> B<nroff>. This option allows pure I<ascii> manual pages to be displayed in I<ascii> with the I<latin1> device. It will not translate any I<latin1> text. The following table shows the translations performed: some parts of it may only be displayed properly when using B<GNU> B<nroff>'s I<latin1>(7) device.
id: Ketika melihat sebuah halaman manual murni I<ascii>(7) dalam sebuah terminal 7 bit atau terminal emulator, beberapa karakter mungkin tidak tampil secara benar ketika menggunakan I<latin1>(7) perangkat deskripsi dengan B<GNU> B<nroff>. Opsi ini mengijinkan halaman manual murni I<ascii> ditampilkan dalam I<ascii> dengan perangkat I<latin1>. Ini tidak akan menerjemahkan teks I<latin1> apapun. Tabel berikut menampilkan penerjemahan yang dilakukan: beberapa bagian dari itu mungkin hanya ditampilkan secara benar ketika menggunakan perangkat B<GNU> B<nroff> I<latin1>(7).

source: Description@Octal@latin1@ascii
id: Deskripsi@oktal@latin1@ascii

source: continuation hyphen@255@\*[softhyphen]@-
id: kelanjutan hyphen@255@\*[softhyphen]@-

source: bullet (middle dot)@267@\(bu@o
id: bullet (tengah titik)@267@\(bu@o

source: multiplication sign@327@\(mu@x
id: perkalian tanda@327@\(mu@x

source: If the I<latin1> column displays correctly, your terminal may be set up for I<latin1> characters and this option is not necessary. If the I<latin1> and I<ascii> columns are identical, you are reading this page using this option or B<%man%> did not format this page using the I<latin1> device description. If the I<latin1> column is missing or corrupt, you may need to view manual pages with this option.
id: jika kolom I<latin1> tampil secara benar, terminal anda mungkin dikonfigurasi untuk karakter I<latin1> dan opsi ini tidak diperlukan. Jika I<latin1> dan I<ascii> kolom identik, anda membaca halaman ini menggunakan opsi ini atau B<%man%> tidak memformat halaman ini menggunakan deskripsi perangkat I<latin1>. Jika I<latin1> kolom hilang atau terkorupsi, anda mungkin butuh untuk melihat halaman manual dengan opsi ini.

source: This option is ignored when using options B<-t>, B<-H>, B<-T>, or B<-Z> and may be useless for B<nroff> other than B<GNU's>.
id: Opsi ini diabaikan ketika menggunakan opsi B<-t>, B<-H>, B<-T>, atau B<-Z> dan mungkin tidak berguna untuk B<nroff> selain dari B<GNU's>.

source: B<-E\ >I<encoding>,\ B<--encoding>=I<encoding>
id: B<-E\ >I<pengkodean>,\ B<--encoding>=I<pengkodean>

source: Generate output for a character encoding other than the default. For backward compatibility, I<encoding> may be an B<nroff> device such as B<ascii>, B<latin1>, or B<utf8> as well as a true character encoding such as B<UTF-8>.
id: Hasilkan keluaran untuk sebuah pengkodean karakter selain dari baku. Untuk kompabilitas kebelakang, I<pengkodean> mungkin sebuah perangkat B<nroff> seperti B<ascii>, B<latin1>, atau B<utf8> baik juga sebuah pengkodean karakter benar seperti B<UTF-8>.

source: Specify the sequence of preprocessors to run before B<nroff> or B<troff>/B<groff>. Not all installations will have a full set of preprocessors. Some of the preprocessors and the letters used to designate them are: B<eqn> (B<e>), B<grap> (B<g>), B<pic> (B<p>), B<tbl> (B<t>), B<vgrind> (B<v>), B<refer> (B<r>). This option overrides the $B<MANROFFSEQ> environment variable. B<%zsoelim%> is always run as the very first preprocessor.
id: Spesifikasikan urutan dari preprosesor untuk dijalankan sebelum B<nroff> atau B<troff>/B<groff>. Tidak seluruh instalasi akan memiliki full set dari preprosesor. Beberapa preprosesor dan huruf digunakan untuk menggunakannya adalah: B<eqn> (B<e>), B<grap> (B<g>), B<pic> (B<p>), B<tbl> (B<t>), B<vgrind> (B<v>), B<refer> (B<r>). Opsi ini override variabel lingkungan $B<MANROFFSEQ>. B<%zsoelim%> selalu berjalan sebagai preproses pertaman.

source: Use I<%troff%> to format the manual page to stdout. This option is not required in conjunction with B<-H>, B<-T>, or B<-Z>.
id: Gunakan I<%troff%> untuk memformat halaman manual ke stdout. Opsi ini tidak dibutuhkan dalam konjungsi dengan B<-H>, B<-T>, atau B<-Z>.

source: B<-T>[I<device>], B<--troff-device>[=I<device>]
id: B<-T>[I<perangkat>], B<-troff-device>[=I<perangkat>]

source: This option is used to change B<groff> (or possibly B<troff's>) output to be suitable for a device other than the default. It implies B<-t>. Examples (provided with Groff-1.17) include B<dvi>, B<latin1>, B<ps>, B<utf8>, B<X75> and B<X100>.
id: Opsi ini digunakan untuk mengubah B<groff> (atau mungkin B<troff>) keluaran ke sebuah perangkat selain dari baku yang lebih sesuai. Ini mengimplikasikan B<-t>. Contoh (disediakan Groff-1.17) termasuk B<dvi>, B<latin1>, B<ps>, B<utf8>, B<X75> dan B<X100>.

source: This option will cause B<groff> to produce HTML output, and will display that output in a web browser. The choice of browser is determined by the optional I<browser> argument if one is provided, by the $B<BROWSER> environment variable, or by a compile-time default if that is unset (usually B<lynx>). This option implies B<-t>, and will only work with B<GNU> B<troff>.
id: Opsi ini akan menyebabkan B<groff> untuk menghasilkan keluaran HTML, dan akan menampilkan keluaran disebuah web browser. Pilihan dari browser ditentukan oleh opsinal argumen I<broser> jika disediakan, oleh variabel lingkungan $B<BROWSER>, atau diwaktu kompilasi baku jika itu tidak diset (biasanya B<lynx>). Opsi ini mengindikasikan B<-t>, dan hanya akan bekerja dengan B<GNU> B<troff>.

source: This option displays the output of B<groff> in a graphical window using the B<gxditview> program. The I<dpi> (dots per inch) may be 75, 75-12, 100, or 100-12, defaulting to 75; the -12 variants use a 12-point base font. This option implies B<-T> with the X75, X75-12, X100, or X100-12 device respectively.
id: Opsi ini menampilkan keluaran dari B<groff> dalam sebuah jendela graphis menggunakan aplikasi B<gxditview>. I<dpi> (titik per inchi) mungkin berupa 75, 75-12, 100, atau 100-12, baku ke 75; -12 variant menggunakan sebuah font dasar 12-titik. Opsi ini mengimplikasikan B<-T> dengan X75, X75-12, X100 atau X100-12 perangkat.

source: B<groff> will run B<troff> and then use an appropriate post-processor to produce output suitable for the chosen device. If I<%troff%> is B<groff>, this option is passed to B<groff> and will suppress the use of a post-processor. It implies B<-t>.
id: B<groff> akan menjalankan B<troff> dan kemudian menggunakan sebuah post prosesor yang sesuai untuk menghasilkan perangkat yang dipilih. Jika I<%troff%> adalah B<groff>, opsi ini akan dilewatkan ke B<groff> dan akan menekan penggunaan dari sebuah post-prosesor. Ini mengimplikasikan B<-t>.

source: Getting help
id: Mendapatkan bantuan

source: A child process returned a non-zero exit status.
id: Sebuah proses anak mengembalikan sebuah status kembali tidak nol.

source: At least one of the pages/files/keywords didn't exist or wasn't matched.
id: Paling tidak satu dari halaman/berkas/kata kunci tidak ada atau tidak cocok.

source: If $B<MANPATH> is set, its value is used as the path to search for manual pages.
id: Jika $B<MANPATH> diset, nilainya digunakan sebagai jalur pencarian untuk halaman manual.

source: The contents of $B<MANROFFOPT> are added to the command line every time B<man> invokes the formatter (B<nroff>, B<troff>, or B<groff>).
id: Isi dari $B<MANROFFOPT> ditambahkan ke baris perintah setiap saat B<man> memanggil pemformat (B<nroff>, B<troff>, atau B<groff>).

source: If $B<MANROFFSEQ> is set, its value is used to determine the set of preprocessors to pass each manual page through. The default preprocessor list is system dependent.
id: Jika $B<MANROFFSEQ> diset, nilainya digunakan untuk menetukan set dari preprosesor untuk dilewatkan ke setiap halaman manual. Daftar baku preprosesor adalah tergantung dari sistem.

source: If $B<MANSECT> is set, its value is a colon-delimited list of sections and it is used to determine which manual sections to search and in what order.
id: Jika $B<MANSECT> diset, nilainya adalah sebuah daftar dipisahkan oleh kolon dari bagian dan ini digunakan untuk menentukan bagian manual mana untuk dicari dan dalam urutan apa.

source: If $B<MANPAGER> or $B<PAGER> is set ($B<MANPAGER> is used in preference), its value is used as the name of the program used to display the manual page. By default, B<%pager%> is used.
id: jika $B<MANPAGER> atau $B<PAGER> diset ($B<MANPAGER> digunakan dalam kesukaan), nilainya digunakan sebagai nama dari aplikasi yang digunakan untuk menampilkan halaman manual. Secara baku, B<%pager%> digunakan.

source: If $B<MANLESS> is set, B<%man%> will not perform any of its usual processing to set up a prompt string for the B<less> pager. Instead, the value of $B<MANLESS> will be copied verbatim into $B<LESS>. For example, if you want to set the prompt string unconditionally to \(lqmy prompt string\(rq, set $B<MANLESS> to \(oqB<-Psmy\ prompt\ string>\(cq.
id: Jika $B<MANLESS> diset, B<%man%> tidak akan melakukan pemrosesan biasa untuk mengkonfigurasi prompt string untuk pager B<less>. Sebaliknya, nilai dari $B<MANLESS> akan disalinkan satu persatu kedalam $B<LESS>. Sebagai contoh, jika anda ingin menset prompt string secara tidak kondisional ke \(lqmy prompt string\(rq, set $B<MANLESS> ke \(oqB<-Psmy\ prompt\ string>\(cq.

source: If $B<BROWSER> is set, its value is a colon-delimited list of commands, each of which in turn is used to try to start a web browser for B<man> B<--html>. In each command, I<%s> is replaced by a filename containing the HTML output from B<groff>, I<%%> is replaced by a single percent sign (%), and I<%c> is replaced by a colon (:).
id: Jika $B<BROWSER> diset, nilai itu adalah daftar dipisahkan kolon dari perintah, setiap perintah itu digunakan untuk mencoba menjalankan sebuah web browser untuk B<man> B<--html>. Dalam setiap perintah, I<%s> digantikan oleh sebuah nama berkas berisi keluaran HTML dari B<groff>, I<%%> digantikan oleh sebuah tanda persen tunggal (%) dan I<%c> digantikan oleh sebuah kolon (:).

source: If $B<MANOPT> is set, it will be parsed prior to B<%man%'s> command line and is expected to be in a similar format. As all of the other B<%man%> specific environment variables can be expressed as command line options, and are thus candidates for being included in $B<MANOPT> it is expected that they will become obsolete. N.B. All spaces that should be interpreted as part of an option's argument must be escaped.
id: Jika $B<MANOPT> diset, ini akan diparse sebelum ke baris perintah B<%man%'s> dan diduga dalam format serupa. Seperti dari yang lain B<%man%> variabel lingkungan spesifik dapat diekspresikan sebagai opsi baris perintah, dan juga kandidat untuk dimasukan dalam $B<MANOPT> ini diduga bahwa mereka akan menjadi obsolete. N.B. Seluruh spasi yang seharusnya diinterpretasikan sebagai bagian dari sebuah argumen opsi harus diescape.

source: If $B<MANWIDTH> is set, its value is used as the line length for which manual pages should be formatted. If it is not set, manual pages will be formatted with a line length appropriate to the current terminal (using an B<ioctl>(2) if available, the value of $B<COLUMNS>, or falling back to 80 characters if neither is available). Cat pages will only be saved when the default formatting can be used, that is when the terminal line length is between 66 and 80 characters.
id: Jika $B<MANWIDTH> diset, nilainya digunakan sebagai panjang baris yang mana halaman manual seharusnya diformat. Jika ini tidak diset, halaman manual akan diformat dengan sebuah panjang baris sesuai dengan terminal sekarang (menggunakan sebuah B<ioctl>(2) jika tersedia, nilai dari $B<COLUMNS>, atau kembali ke 80 karakter jika tidak tersedia). Halaman cat hanya akan disimpat ketika format baku dapat digunakan, yaitu ketika panjang baris terminal berada diantara 66 dan 80 karakter.

source: Normally, when output is not being directed to a terminal (such as to a file or a pipe), formatting characters are discarded to make it easier to read the result without special tools. However, if $B<MAN_KEEP_FORMATTING> is set to any non-empty value, these formatting characters are retained. This may be useful for wrappers around B<%man%> that can interpret formatting characters.
id: Biasanya, ketika keluaran tidak sedang diarahkan ke sebuah terminal (seperti ke sebuah berkas atau sebuah pipe), pemformatan karakter diabaikan untuk mempermudah pembacaan tanpa perangkat spesial. Akan tetapi, jika $B<MAN_KEEP_FORMATTING> diset ke nilai tidak kosong apapun, pemformatan karakter ini dijaga. Ini mungkin berguna untuk memperbaiki B<%man%> yang dapat diinterpretasikan pemformatan karakter.

source: Depending on system and implementation, either or both of $B<LANG> and $B<LC_MESSAGES> will be interrogated for the current message locale. B<%man%> will display its messages in that locale (if available). See B<setlocale>(3) for precise details.
id: Tergantung dari sistem dan implementasi, baik atau kedua dari $B<LANG> dan $B<LC_MESSAGESS> akan diintergasi untuk pesan lokal sekarang. B<%man%> akan menampilkan pesannya dalam lokal tersebut (jika tersedia). Lihat B<setlocale>(3) untuk detail lebih tepatnya.

source: man-db configuration file.
id: berkas konfigurasi man-db.

source: A global manual page hierarchy.
id: Sebuah hierarki halaman manual global.
