Repository: Distrotech/man-db
Catalog: po/*.po
Languages: ro

source: badly formed configuration directive: '%s'
ro: directivã de configurare greºit formatã: `%s'

source: pipeline input not open
ro: intrarea de pipeline nu este deschisã

source: pipeline output not open
ro: ieºirea de pipeline nu este deschisã

source: pipe failed
ro: legãturã(pipe) eºuatã

source: fork failed
ro: fork eºuat

source: dup2 failed
ro: dup2 eºuat

source: close failed
ro: închidere eºuatã

source: can't execute %s
ro: nu pot executa %s

source: closing pipeline input stream failed
ro: închiderea secvenþei(stream) de intrare pipeline a eºuat

source: closing pipeline input failed
ro: închiderea intrãrii(input) de pipeline a eºuat

source: closing pipeline output stream failed
ro: închiderea secvenþei(stream) de ieºire pipeline a eºuat

source: closing pipeline output failed
ro: închiderea ieºirii(output) de pipeline a eºuat

source: waitpid failed
ro: waitpid eºuat

source: can't install SIGCHLD handler
ro: nu s-a putut instala instrumentul(handler) SIGCHLD

source: multi key %s does not exist
ro: multi key %s nu existã

source: can't lock index cache %s
ro: nu se poate face lock pe index cache %s

source: index cache %s corrupt
ro: index cache %s este corupt

source: cannot replace key %s
ro: nu s-a putut înlocui cheia %s

source: only %d fields in content
ro: numai %d câmpuri în conþinut

source: bad fetch on multi key %s
ro: aducere(fetch) incorectã în multi chei %s

source: cannot insert unused key %s
ro: nu s-a putut insera cheia nefolositã %s

source: fatal: unable to insert version identifier into %s
ro: fatal: nu se poate insera identificatorul de versiune în %s

source: warning: %s has no version identifier
ro: avertisment: %s nu are identificator de versiune

source: warning: %s is version %s, expecting %s
ro: avertisment: %s este versiunea %s, se aºtepta %s

source: can't open %s for reading
ro: nu se poate deschide %s pentru citire

source: usage: %s [-dhV] [-C file] [-M manpath] [section] ...
ro: folosire: %s [-dhV] [-C fiºier] [-M caleman] [secþiune] ...

source: -d, --debug produce debugging info. -M, --manpath path set search path for manual pages to `path'. -C, --config-file file use this user configuration file. -V, --version show version. -h, --help show this usage message.
ro: -d, --debug produce informaþii de debugging. -M, --manpath cale seteazã calea de cãutare pentru paginile de manual la `cale'. -C, --config-file fiºier foloseºte acest fiºier de configuraþie utilizator. -V, --version afiºeazã versiunea. -h, --help afiºeazã acest mesaj de folosire.

source: cannot read database %s
ro: nu se poate citi baza de date %s.

source: can't get man command's exit status
ro: nu s-a putut afla starea de ieºire a comenzii man

source: man command failed with exit status %d
ro: comanda man a eºuat cu stare de ieºire %d

source: unable to reset cursor position in %s
ro: nu se poate reseta poziþia cursorului în %s

source: NULL content for key: %s
ro: conþinut NULL pentru cheia: %s

source: Updating cat files for section %s of man hierarchy %s
ro: Se înnoiesc(update) fiºierele cat pentru secþiunea %s a ierarhiei man %s

source: cannot write within %s
ro: nu se poate scrie în %s

source: unable to update %s
ro: nu se poate înnoi(update) %s

source: warning: %s/man%s/%s.%s*: competing extensions
ro: avertisment: %s/man%s/%s.%s*: extensii concurente

source: can't update index cache %s
ro: nu se poate înnoi(update) index cache %s

source: warning: %s: bad symlink or ROFF `.so' request
ro: avertisment: %s: symlink eronat sau cerere ROFF `.so'

source: warning: %s: ignoring empty file
ro: avertisment: %s: se ignorã fiºierul vid.

source: warning: %s: whatis parse for %s(%s) failed
ro: avertisment: %s: analiza(parse) whatis pentru %s(%s) eºuatã

source: can't search directory %s
ro: nu se poate cãuta directorul %s

source: Updating index cache for path `%s/%s'. Wait...
ro: Se înnoieºte(update) index cache-ul pentru calea `%s%s'. Aºteptaþi...

source: can't create index cache %s
ro: nu se poate crea index cache-ului %s

source: done.
ro: efectuat.

source: Purging old database entries in %s...
ro: Se curãþã(purge) intrãrile vechi ale bazei de date în %s...

source: can't create a temporary filename
ro: nu se poate crea un nume de fiºier temporar

source: command '%s' failed with exit status %d
ro: comanda `%s' a eºuat cu stare de ieºire %d

source: Can't convert %s to cat name
ro: Nu pot converti %s în nume cat

source: warning: failed to store entry for %s(%s)
ro: avertisment: am eºuat în depozitarea intrãrii pentru %s (%s)

source: can't get passwd structure for uid 0
ro: nu se poate primi structura passwd pentru uid 0

source: warning: %s: ignoring bogus filename
ro: avertisment: %s: se ignorã numele de fiºier fals(bogus)

source: -d, --debug emit debugging messages. -e, --extension limit search to extension type `extension'. -i, --ignore-case look for pages case-insensitively (default). -I, --match-case look for pages case-sensitively. -V, --version show version. -h, --help show this usage message.
ro: -d, --debug emitere mesaje de debugging. -e, --extension limiteazã cãutarea la tipul de extensie `extension'. -i, --ignore-case cautã paginile folosind caz insenzitiv (implicit). -I, --match-case cautã paginile folosind caz senzitiv. -V, --version afiºeazã versiunea. -h, --help afiºeazã acest mesaj de folosire.

source: warning: whatis for %s exceeds %d bytes, truncating.
ro: avertisment: whatis pentru %s depãºeºte %d octeþi, se trunchiazã.

source: can't open %s
ro: nu se poate deschide %s

source: usage: %s [-mcwfhV] file ...
ro: folosire: %s [-mcwfhV] fiºier ...

source: -m, --man parse as man page. -c, --cat parse as cat page. -w, --whatis show whatis information. -f, --filters show guessed series of preprocessing filters. -V, --version show version. -h, --help show this usage message. The defaults are --man and --whatis.
ro: -m, --man analizeazã ca paginã man. -c, --cat analizeazã ca paginã cat. -w, --whatis afiºeazã informaþie whatis. -f, --filters afiºeazã seriile bãnuite de filtre de preprocesare. -V, --version afiºeazã versiunea. -h, --help afiºeazã acest mesaj de folosire. Implicitele sunt --man ºi --whatis.

source: -m -c: incompatible options
ro: -m -c: opþiuni incompatibile

source: command exited with status %d: %s
ro: comanda a ieºit cu starea %d: %s

source: usage: %s [-c|-f|-k|-w|-tZT device] [-i|-I] [-adlhu7V] [-Mpath] [-Ppager] [-Cfile] [-Slist] [-msystem] [-pstring] [-Llocale] [-eextension] [section] page ...
ro: folosire: %s [-c|-f|-k|-w|-tZT dispozitiv] [-i|-I] [-adlhu7V] [-Mcale] [-Ppager] [-Cfiºier] [-Slistã] [-msistem] [-pºir] [-Llocalizare] [-eextensie] [secþiune] paginã ...

source: usage: %s [-c|-f|-k|-w] [-i|-I] [-adlhu7V] [-Mpath] [-Ppager] [-Cfile] [-Slist] [-msystem] [-pstring] [-Llocale] [-eextension] [section] page ...
ro: folosire: %s [-c|-f|-k|-w] [-i|-I] [-adlhu7V] [-Mcale] [-Ppager] [-Cfiºier] [-Slistã] [-msistem] [-pºir] [-Llocalizare] [-eextensie] [secþiune] paginã ...

source: -a, --all find all matching manual pages. -d, --debug emit debugging messages. -e, --extension limit search to extension type `extension'. -f, --whatis equivalent to whatis. -k, --apropos equivalent to apropos. -w, --where, --location print physical location of man page(s). -W, --where-cat, --location-cat print physical location of cat file(s). -l, --local-file interpret `page' argument(s) as local filename(s). -u, --update force a cache consistency check. -i, --ignore-case look for pages case-insensitively (default). -I, --match-case look for pages case-sensitively. -r, --prompt string provide the `less' pager with a prompt -c, --catman used by catman to reformat out of date cat pages. -7, --ascii display ASCII translation of certain latin1 chars. -E, --encoding encoding use the selected nroff device and display in pager.
ro: -a, --all gãseºte toate paginile de manual potrivite. -d, --debug emite mesaje de debugging. -e, --extension limiteazã cãutarea la tipul de extensie `extensie'. -f, --whatis echivalent cu whatis. -k, --apropos echivalent cu apropos. -w, --where, --location afiºeazã locaþia fizicã a paginii(ilor) de man. -W, --where-cat, --location-cat afiºeazã locaþia fizicã a paginii(ilor) de cat. -l, --local-file interpreteazã parametrul(ii) `paginã' ca nume de fiºier(e)local(e). -u, --update forþeazã o verificare de consistenþã a cache-ului. -i, --ignore-case cautã paginile caz insenzitiv (implicit). -I, --match-case cautã paginile caz senzitiv. -r, --prompt ºir furnizeazã pagerul `less' cu întrebare(prompt) -c, --catman folosit de catman pentru a reformata paginile de cat expirate. -7, --ascii afiºeazã traducerea ASCII a anumitor caracterelatin 1. -E, --encoding codare se foloseºte dispozitivul nroff selectat ºi se afiºeazã înpager.

source: -t, --troff use %s to format pages. -T, --troff-device device use %s with selected device.
ro: -t, --troff foloseºte %s pentru a formata paginile. -T, --troff-device dispozitiv foloseºte %s cu dispozitivul selectat.

source: -H, --html use lynx or argument to display html output. -Z, --ditroff use groff and force it to produce ditroff. -X, --gxditview use groff and display through gxditview (X11): -X = -TX75, -X100 = -TX100, -X100-12 = -TX100-12.
ro: -H, --html foloseºte lynx sau parametru pentru a afiºa output HTML. -Z, --ditroff foloseºte groff ºi forþeazã producerea ditroff. -X, --gxditview foloseºte groff ºi afiºeazã prin gxditview (X11): -X = -TX75, -X100 = -TX100, -X100-12 = -TX100-12.

source: -D, --default reset all options to their default values. -C, --config-file file use this user configuration file. -M, --manpath path set search path for manual pages to `path'. -P, --pager pager use program `pager' to display output. -S, --sections list use colon separated section list. -m, --systems system search for man pages from other unix system(s). -L, --locale locale define the locale for this particular man search. -p, --preprocessor string string indicates which preprocessors to run. e - [n]eqn p - pic t - tbl g - grap r - refer v - vgrind -V, --version show version. -h, --help show this usage message.
ro: -D, --default reseteazã toate opþiunile la valorile lor implicite -C, --config-file fiºier foloseºte acest fiºier de configurare al utilzatorului. -M, --manpath cale seteazã calea de cãutare pentru paginile de manual la `cale' -P, --pager pager foloseºte programul `pager' pentru a afiºa output-ul. -S, --sections listã foloseºte listã de secþiuni separatã prin douã puncte. -m, --systems sistem cautã pagini de man din alt(e) sistem(e) unix. -L, --locale localizare defineºte localizarea pentru aceastã particularã cãutare prin man. -p, --preprocessor ºir ºir indicã ce preprocesor va rula. e - [n]eqn p - pic t - tbl g - grap r - refer v - vgrind -V, --version afiºeazã versiunea. -h, --help afiºeazã acest mesaj de folosire.

source: What manual page do you want from section %s?
ro: Ce paginã de manual doriþi din secþiunea %s?

source: What manual page do you want?
ro: Ce paginã de manual doriþi?

source: See '%s' for help when manual pages are not available.
ro: Citiþi `%s' pentru ajutor în caz cã paginile de manual nu sunt disponibile.

source: can't chdir to %s
ro: nu se poate schimba directorul(chdir) în %s

source: Manual page
ro: Paginã de manual

source: mandb command failed with exit status %d
ro: comanda mandb a eºuat cu stare de ieºire %d

source: : incompatible options
ro: : opþiuni incompatibile

source: error trying to read from stdin
ro: eroare în încercarea de a citi de la stdin

source: error writing to temporary file %s
ro: eroare în scrierea fiºierului temporar %s

source: ignoring unknown preprocessor `%c'
ro: se ignorã preprocesorul necunoscut `%c'

source: can't chown %s
ro: nu se poate face chown pe %s

source: can't chmod %s
ro: nu se poate face chmod pe %s

source: can't rename %s to %s
ro: nu se poate redenumi %s în %s

source: can't set times on %s
ro: nu se poate seta timpul pe %s

source: can't unlink %s
ro: nu se poate scoate linkul(unlink) la %s

source: Still saving the page, please wait...
ro: Încã se salveazã pagina, vã rugãm aºteptaþi...

source: can't change to directory %s
ro: nu se poate schimba în directorul %s

source: can't remove directory %s
ro: nu se poate ºterge directorul %s

source: cannot write to %s in catman mode
ro: nu se poate scrie în %s în modul catman

source: %s: relying on whatis refs is deprecated
ro: %s: încrederea în referinþele whatis este învechitã

source: internal error: candidate type %d out of range
ro: eroare internã: candidatul tip %d depãºeºte domeniul

source: --Man-- next: %s [ view (return) | skip (Ctrl-D) | quit (Ctrl-C) ]
ro: --Man-- urmãtor: %s [ vizualizare (return) | omitere (Ctrl-D) | ieºire (Ctrl-C) ]

source: usage: %s [-dqspuct|-h|-V] [-C file] [-f filename] [manpath]
ro: folosire: %s [-dqspuct|-h|-V] [-C fiºier] [-f numefiºier] [caleman]

source: -d, --debug produce debugging info. -q, --quiet work quietly, except for 'bogus' warning. -s, --no-straycats don't look for or add stray cats to the dbs. -p, --no-purge don't purge obsolete entries from the dbs. -u, --user-db produce user databases only. -c, --create create dbs from scratch, rather than updating. -t, --test check manual pages for correctness. -f, --filename update just the entry for this filename. -C, --config-file use this user configuration file. -V, --version show version. -h, --help show this usage message.
ro: -d, --debug produce informaþii de debugging. -q, --quiet lucreazã silenþios, exceptând avertismentele de 'bogus'. -s, --no-straycats nu cãuta sau nu adãuga cat-uri rãtãcite în b.d.-uri. -p, --no-purge nu elimina intrãrile expirate din b.d.-uri. -u, --user-db produce doar baza de date utilizator. -c, --create creeazã b.d.-uri din nou decât sã faci update. -t, --test verificã paginile de manual pentru corectitudine. -f, --filename înnoieºte(update) doar intrarea pentru acest nume fiºier. -C, --config-file foloseºte acest fiºier de configuraþie utilizator. -V, --version afiºeazã versiunea. -h, --help afiºeazã acest mesaj de folosire.

source: can't remove %s
ro: nu se poate ºterge %s

source: can't write to %s
ro: nu se poate scrie în %s

source: can't read from %s
ro: nu se poate citi din %s

source: Processing manual pages under %s...
ro: Se proceseazã paginile de manual sub %s...

source: the setuid man user "%s" does not exist
ro: utilizatorul man setuidat "%s" nu existã

source: warning: no MANDB_MAP directives in %s, using your manpath
ro: avertisment: nu existã directive MANDB_MAP în %s, se foloseºte calea voastrã de man

source: %d man subdirectories contained newer manual pages. %d manual pages were added.
ro: %d subdirectoare man conþin pagini de manual noi. %d pagini de manual au fost adãugate.

source: %d stray cats were added.
ro: %d cat-uri rãtãcite au fost adãugate.

source: %d old database entries were purged.
ro: %d intrãri vechi în baza de date au fost eliminate.

source: can't make sense of the manpath configuration file %s
ro: nu pot înþelege fiºierul de configuraþie pentru cale man %s

source: warning: %s
ro: avertisment: %s

source: warning: %s isn't a directory
ro: avertisment: %s nu este un director

source: manpath list too long
ro: lista de cãi man este prea lungã

source: warning: $PATH not set
ro: avertisment: nu este setat $PATH

source: warning: empty $PATH
ro: avertisment: %PATH vid

source: warning: $MANPATH set, prepending %s
ro: avertisment: $MANPATH setat, se adaugã la început(prepending) %s

source: warning: $MANPATH set, appending %s
ro: avertisment: $MANPATH setat, se adaugã(append) %s

source: warning: $MANPATH set, inserting %s
ro: avertisment: $MANPATH setat, se insereazã %s

source: warning: $MANPATH set, ignoring %s
ro: avertisment: $MANPATH setat, se ignorã %s

source: warning: cannot create catdir %s
ro: avertisment: nu se poate crea catdir %s

source: can't parse directory list `%s'
ro: nu se poate analiza(parse) lista de directoare `%s'

source: can't open the manpath configuration file %s
ro: nu se poate deschide fiºierul de configurare al cãii de man %s

source: warning: mandatory directory %s doesn't exist
ro: avertisment: directorul necesar %s nu existã

source: can't determine current directory
ro: nu se poate determina directorul curent

source: warning: %s does not begin with %s
ro: avertisment: %s nu începe cu %s

source: usage: %s [[-gcdq] [-C file] [-m system]] | [-V] | [-h]
ro: folosire: %s [[-gcdq] [-C fiºier] [-m sistem]] | [-V] | [-h]

source: -c, --catpath show relative catpaths. -g, --global show the entire global manpath. -d, --debug produce debugging info. -q, --quiet produce fewer warnings. -C, --config-file file use this user configuration file. -m, --systems system express which `systems' to use. -V, --version show version. -h, --help show this usage message.
ro: -c, --catpath afiºeazã cãile de cat relatibe. -g, --global afiºeazã întreaga cale man globalã. -d, --debug produce informaþii de debugging. -q, --quiet produce mai puþine avertismente. -C, --config-file fiºier foloseºte acest fiºier de configurare utilizator. -m, --systems sistem exprimã ce `sistem' trebuie folosit. -V, --version afiºeazã versiunea. -h, --help afiºeazã acest mesaj de folosire.

source: warning: no global manpaths set in config file %s
ro: avertisment: nu existã cãi man globale setate în fiºierul de configurare %s

source: can't set effective uid
ro: nu se poate seta uid efectiv

source: can't fork
ro: nu se poate face fork

source: can't resolve %s
ro: nu se poate rezolva %s

source: warning: %s is a dangling symlink
ro: avertisment: %s este un symlink nesigur(dangling)

source: Checking for stray cats under %s...
ro: Se verificã cat-urile rãtãcite sub %s...

source: warning: can't create temp file %s
ro: avertisment: nu se poate crea fiºierul temporar %s

source: warning: can't update index cache %s
ro: avertisment: nu se poate înnoi(update) index cache-ul %s

source: %s is self referencing
ro: %s este auto-referinþã(self-referencing)

source: %s, version %s, %s
ro: %s, versiunea %s, %s

source: warning: can't read the fallback whatis text database.
ro: avertisment: nu se poate citi rezultatul bazei de date text whatis

source: warning: %s contains a pointer loop
ro: avertisment: %s conþine o buclã pointer

source: (unknown subject)
ro: (subiect necunoscut)

source: Database %s corrupted; rebuild with mandb --create
ro: Baza de date %s e coruptã; reconstruiþi cu mandb --create

source: %s: nothing appropriate.
ro: %s: nimic potrivit.

source: %s what?
ro: %s ce?

source: Don't know which program should I run being >%s<
ro: Nu ºtiu ce program ar trebui sã rulez fiind >%s<

source: %s: Failed su to user %s
ro: %s:su spre user %s eºuat
